<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML 3//EN">
<HTML><HEAD>
<TITLE>Gu&iacute;a de iniciaci&oacute;n r&aacute;pida</TITLE>
<!-- Begin Header Records  ========================================== -->
<!-- D:\IDWB\TEMP\idwt1049\awqbg000.scr converted by idb2h R4.2 (359) -->
<!-- ID Workbench Version (OS2) on 1 Jan 1999 at 13:37:05             -->
<!-- (C) Copyright IBM Corporation, 1999                              -->
<!-- Reservados todos los derechos. Materiales bajo licencia          -->
<!-- propiedad de IBM                                                 -->
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
<META HTTP-EQUIV="updated" CONTENT="Vie, 01 Ene 1999 13:37:04">
<META HTTP-EQUIV="review" CONTENT="Sab, 01 Ene 2000 13:37:04">
<META HTTP-EQUIV="expires" CONTENT="Lun, 01 Ene 2001 13:37:04">
</HEAD><BODY>
<!-- (C) IBM Corporation 2000. All Rights Reserved    --> 
<BODY bgcolor="ffffff"> 
<!-- End Header Records  ============================================ -->
<A NAME="Top_Of_Page"></A>
<H1>Gu&iacute;a de iniciaci&oacute;n r&aacute;pida</H1>
<HR><H1><A NAME="Header_1" HREF="awqbg002.htm#ToC_1">IBM AFS para Windows Gu&iacute;a de iniciaci&oacute;n r&aacute;pida</A></H1>
<HR><H2><A NAME="Header_2" HREF="awqbg002.htm#ToC_2">Introducci&oacute;n</A></H2>
<A NAME="IDX178"></A>
<A NAME="IDX179"></A>
<P>AFS<SUP><SUP>(R)</SUP></SUP> es un sistema de archivos de empresa que ofrece
acceso a los archivos mediante un espacio de archivos compartido. Al
combinar los sistemas de archivos locales de varias m&aacute;quinas Servidor de
archivos, AFS presenta un solo espacio de archivos que no depende de los
l&iacute;mites de la m&aacute;quina. Los archivos se guardan en diversas m&aacute;quinas de
la red, pero se puede acceder a los mismos desde todas las m&aacute;quinas de la
empresa.
<P>IBM AFS para Windows<SUP><SUP>(R)</SUP></SUP>, versi&oacute;n 3.6 ampl&iacute;a las
funciones completas de AFS a sistemas operativos Microsoft<SUP><SUP>(R)</SUP></SUP>
Windows.
<HR><H2><A NAME="Header_3" HREF="awqbg002.htm#ToC_3">Visi&oacute;n general de este documento</A></H2>
<P>
<A NAME="IDX180"></A>
Este documento resume los requisitos previos a la instalaci&oacute;n, contiene
instrucciones detalladas sobre c&oacute;mo instalar, configurar y desinstalar AFS
para Windows y describe los cambios que se realizan en el sistema durante los
procesos de instalaci&oacute;n y desinstalaci&oacute;n. Este documento describe
tambi&eacute;n la documentaci&oacute;n que se suministra con AFS para Windows.
<P><H3><A NAME="Header_4" HREF="awqbg002.htm#ToC_4">A qui&eacute;n va destinado</A></H3>
<P>
<A NAME="IDX181"></A>
Este documento contiene informaci&oacute;n destinada a los administradores del
sistema y a los usuarios responsables de instalar y configurar los productos
que se incluyen en AFS para Windows. En este documento se da por
supuesto que los administradores est&aacute;n familiarizados con la administraci&oacute;n
del sistema en general y que los usuarios est&aacute;n familiarizados con los
t&eacute;rminos y conceptos b&aacute;sicos de los sistemas operativos Microsoft
Windows.
<P><H3><A NAME="Header_5" HREF="awqbg002.htm#ToC_5">Organizaci&oacute;n</A></H3>
<P>Este documento est&aacute; organizado del siguiente modo:
<UL>
<LI><A HREF="#HDRINSTALLATION">Instalaci&oacute;n de AFS para Windows</A>, describe las combinaciones de componentes de AFS que se
pueden instalar, el procedimiento para instalar los productos que se incluyen
en AFS para Windows y muestra los cambios que el proceso de instalaci&oacute;n
realiza en el sistema.
</LI><LI><A HREF="#HDRDOCUMENT">Documentaci&oacute;n de AFS para Windows</A>, presenta los distintos tipos de documentaci&oacute;n que se
suministran con AFS para Windows y describe los procedimientos a seguir para
acceder a esta documentaci&oacute;n.
</LI><LI><A HREF="#HDRCONFIGURE">Configuraci&oacute;n de AFS para Windows</A>, describe los procedimientos a seguir para configurar los
productos que se incluyen en AFS para Windows.
</LI><LI><A HREF="#HDRUNINSTALL">Desinstalaci&oacute;n de AFS para Windows</A>, describe los requisitos previos a la desinstalaci&oacute;n, el
procedimiento a seguir para desinstalar los productos que se incluyen en AFS
para Windows y muestra los cambios que el proceso de desinstalaci&oacute;n realiza en
el sistema.
</LI></UL>
<HR><H2><A NAME="HDRINSTALLATION" HREF="awqbg002.htm#ToC_6">Instalaci&oacute;n de AFS para Windows</A></H2>
<P>Esta secci&oacute;n describe las combinaciones de componentes de AFS que se
pueden instalar, el procedimiento a seguir para instalar AFS para Windows y
muestra los cambios que el proceso de instalaci&oacute;n realiza en el
sistema.
<P><H3><A NAME="Header_7" HREF="awqbg002.htm#ToC_7">Componentes de AFS para Windows</A></H3>
<P>
<A NAME="IDX182"></A>
AFS para Windows, versi&oacute;n 3.6, incluye los siguientes
componentes:
<UL>
<LI>
<A NAME="IDX183"></A>
<A NAME="IDX184"></A>
<A NAME="IDX185"></A>
<B>AFS Server</B>
<P>El AFS Server ejecuta procedimientos de servidor de AFS e incluye el
Asistente de configuraci&oacute;n de AFS Server, que facilita la
configuraci&oacute;n.
</LI><LI>
<A NAME="IDX186"></A>
<A NAME="IDX187"></A>
<A NAME="IDX188"></A>
<B>AFS Control Center</B>
<P>El AFS Control Center incluye dos potentes herramientas de interfaz gr&aacute;fica
de usuario (GUI) que ayudan a los administradores del sistema AFS a
administrar c&eacute;lulas de AFS: AFS Server Manager y AFS Account
Manager.
</LI><LI>
<A NAME="IDX189"></A>
<A NAME="IDX190"></A>
<A NAME="IDX191"></A>
<B>AFS Client</B>
<P>El AFS Client ofrece acceso directo al espacio de archivos de AFS,
permitiendo a los usuarios gestionar archivos y directorios de AFS. El
AFS Client incluye la Pasarela de AFS Light.
</LI><LI>
<A NAME="IDX192"></A>
<A NAME="IDX193"></A>
<A NAME="IDX194"></A>
<B>AFS Light</B>
<P>AFS Light ofrece acceso al espacio de archivos de AFS a trav&eacute;s de una
m&aacute;quina Pasarela de AFS Light, lo que permite a los usuarios gestionar
archivos y directorios de AFS.
</LI><LI>
<A NAME="IDX195"></A>
<B>AFS Supplemental Documentation</B>
<P>AFS Supplemental Documentation ofrece informaci&oacute;n adicional sobre la
administraci&oacute;n del sistema AFS e incluye los siguientes documentos:
<I>IBM AFS Administration Guide</I> e <I>IBM AFS Administration
Reference</I>.
</LI></UL>
<P><H3><A NAME="HDROPTIONS" HREF="awqbg002.htm#ToC_8">Opciones de instalaci&oacute;n</A></H3>
<P>
<A NAME="IDX196"></A>
<A NAME="IDX197"></A>
<A NAME="IDX198"></A>
Puede instalar los componentes de AFS para Windows en diversas combinaciones,
dependiendo de su sistema operativo Windows. Consulte <I>IBM AFS for
Windows Release Notes</I> para obtener informaci&oacute;n sobre los requisitos
espec&iacute;ficos de software para cada componente de AFS para Windows. Tenga
en cuenta que si instala el AFS Server, debe tambi&eacute;n instalar el AFS Client, a
no ser que el AFS Client, versi&oacute;n 3.6, ya est&eacute; instalado en la
m&aacute;quina. Siga el procedimiento de instalaci&oacute;n descrito en el apartado <A HREF="#HDRHOWTOINSTALL">Para instalar AFS para Windows</A>, independientemente de los componentes que vaya a
instalar.
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Nota:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">
<A NAME="IDX199"></A>
<A NAME="IDX200"></A>
<A NAME="IDX201"></A>
<A NAME="IDX202"></A>
<A NAME="IDX203"></A>
Dispone de la opci&oacute;n de modificar el programa de configuraci&oacute;n de AFS para
Windows para inhabilitar todos los componentes excepto el componente
cliente. Este programa de configuraci&oacute;n de s&oacute;lo cliente impide que los
usuarios puedan instalar los componentes que no sean el AFS Client.
Para realizar una instalaci&oacute;n de s&oacute;lo cliente, cree el archivo
<B>setup.co</B> en el mismo directorio que los dem&aacute;s archivos de
instalaci&oacute;n; el programa de configuraci&oacute;n s&oacute;lo permitir&aacute; que se instale
el componente AFS Client. Tenga en cuenta que el contenido del archivo
<B>setup.co</B> es irrelevante. Siga el procedimiento de
instalaci&oacute;n descrito en el apartado <A HREF="#HDRHOWTOINSTALL">Para instalar AFS para Windows</A> independientemente del tipo de instalaci&oacute;n que lleve a
cabo.
</TD></TR></TABLE>
<P><H3><A NAME="Header_9" HREF="awqbg002.htm#ToC_9">C&oacute;mo realizar la actualizaci&oacute;n a partir de una versi&oacute;n anterior</A></H3>
<P>
<A NAME="IDX204"></A>
<A NAME="IDX205"></A>
<A NAME="IDX206"></A>
En una m&aacute;quina Windows NT, <I>no</I> es necesario desinstalar los
componentes de AFS para Windows para actualizar el software; puede
instalar este release de AFS para Windows en su sistema <I>sin</I>
eliminar ni desconfigurar el software existente. Para actualizar AFS
para Windows, siga el procedimiento de instalaci&oacute;n descrito en el apartado <A HREF="#HDRHOWTOINSTALL">Para instalar AFS para Windows</A>. Durante el proceso de instalaci&oacute;n, el componente AFS
de la versi&oacute;n anterior se actualiza y se conserva la informaci&oacute;n de
configuraci&oacute;n de AFS.
<P>En una m&aacute;quina Windows 95 o Windows 98, debe desinstalar el componente AFS
Light previamente instalado, tal como se describe en el apartado <A HREF="#HDRTOUNINSTALL">Para desinstalar AFS para Windows</A>, antes de actualizar AFS Light.
<P>Tenga en cuenta que la herramienta de instalaci&oacute;n de AFS para Windows
<I>no</I> permite a los usuarios instalar componentes de AFS que tengan
distintos n&uacute;meros de versi&oacute;n. Si tiene m&aacute;s de un componente de AFS para
Windows instalado en su m&aacute;quina, no puede actualizar un componente sin
actualizar tambi&eacute;n los dem&aacute;s componentes.
<P><H3><A NAME="HDRHOWTOINSTALL" HREF="awqbg002.htm#ToC_10">Para instalar AFS para Windows</A></H3>
<A NAME="IDX207"></A>
<A NAME="IDX208"></A>
<A NAME="IDX209"></A>
<A NAME="IDX210"></A>
<A NAME="IDX211"></A>
<A NAME="IDX212"></A>
<A NAME="IDX213"></A>
<P>Antes de instalar AFS para Windows, consulte <I>IBM AFS for Windows
Release Notes</I> para obtener una descripci&oacute;n detallada de los requisitos
previos a la instalaci&oacute;n. Si est&aacute; ejecutando otras aplicaciones de
Windows, es recomendable que salga de las mismas antes de instalar AFS para
Windows. 
<OL TYPE=1>
<LI>Inserte el disco de instalaci&oacute;n de AFS para Windows en la unidad de
CD-ROM.
</LI><LI>Ejecute el programa <B>setup</B> de AFS para Windows siguiendo uno de
estos m&eacute;todos:
<UL>
<LI>En el men&uacute; <B>Inicio</B>, seleccione <B>Ejecutar</B>.
Escriba <TT><I>unidad</I><B>:\setup</B></TT> donde
<I>unidad</I> es la letra de la unidad de CD-ROM. Pulse
<B>Aceptar</B>.
</LI><LI>En el <B>Explorador de Windows</B>, seleccione la unidad de CD-ROM y
efect&uacute;e una doble pulsaci&oacute;n sobre el programa
<B>setup.exe</B>.
</LI></UL>
</LI><LI>Aparecer&aacute; el recuadro de di&aacute;logo de bienvenida. Seleccione el bot&oacute;n
<B>Siguiente</B> para continuar con el proceso de instalaci&oacute;n.
</LI><LI>Aparecer&aacute; el recuadro de di&aacute;logo Seleccionar componentes.
<UL>
<LI>En el recuadro <B>Componentes</B>, seleccione los componentes de AFS
para Windows que desee instalar o actualizar. Consulte el apartado <A HREF="#HDROPTIONS">Opciones de instalaci&oacute;n</A> para obtener informaci&oacute;n sobre las distintas combinaciones
de componentes que se pueden instalar en una m&aacute;quina Windows. Tenga en
cuenta que si va a instalar el AFS Server, debe tambi&eacute;n instalar o actualizar
el AFS Client, a no ser que el AFS Client, versi&oacute;n 3.6, ya est&eacute;
instalado en el sistema.
</LI><LI>El recuadro <B>Carpeta de destino</B> indica la unidad y directorio
por omisi&oacute;n donde se instalar&aacute;n los componentes seleccionados. La
unidad por omisi&oacute;n es la unidad en la que est&aacute; instalado Windows. El
directorio por omisi&oacute;n de dicha unidad es <B>\Archivos de
programa\Ibm\Afs</B>. Para seleccionar otra unidad y/o directorio,
seleccione el bot&oacute;n <B>Examinar</B>. 
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Nota:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">Si va a realizar una actualizaci&oacute;n a partir de una versi&oacute;n anterior de AFS
para Windows o va a volver a instalar AFS para Windows, el directorio de
instalaci&oacute;n que elija debe coincidir con el directorio de instalaci&oacute;n
utilizado para la versi&oacute;n instalada anteriormente.
</TD></TR></TABLE>
</LI></UL>
<P>Seleccione el bot&oacute;n <B>Siguiente</B> para continuar con el proceso de
instalaci&oacute;n.
</LI><LI>Los archivos de aplicaci&oacute;n correspondientes a los componentes
seleccionados de AFS para Windows se instalar&aacute;n en el sistema. Cuando
finalice el proceso de instalaci&oacute;n, aparecer&aacute; el recuadro de di&aacute;logo
Instalaci&oacute;n completada, que le indica que debe volver a arrancar el sistema
para poder utilizar los productos de AFS instalados. Seleccione
<B>S&iacute;, deseo reiniciar mi equipo ahora</B> y luego seleccione el bot&oacute;n
<B>Finalizar</B>. El sistema concluir&aacute; y se volver&aacute; a
arrancar. 
<P>La instalaci&oacute;n de AFS para Windows habr&aacute; finalizado.
</LI></OL>
<P><H3><A NAME="Header_11" HREF="awqbg002.htm#ToC_11">Cambios efectuados en el sistema</A></H3>
<P>
<A NAME="IDX214"></A>
Esta secci&oacute;n describe los cambios que se efect&uacute;an en el sistema al instalar
cada componente de AFS para Windows. La informaci&oacute;n de esta secci&oacute;n se
basa en los valores de instalaci&oacute;n por omisi&oacute;n.
<P><H4><A NAME="HDRCLIENTCHANGE">Cambios efectuados en el sistema al instalar el AFS Client</A></H4>
<P>El proceso de instalaci&oacute;n del AFS Client para Windows NT efect&uacute;a los
siguientes cambios en el sistema:
<UL>
<LI>Crea un grupo de programas en el men&uacute; <B>Inicio</B> denominado
<B>IBM AFS</B> con las siguientes aplicaciones:
<DL>
<DD><P>La entrada de programa <B>Documentation (Documentaci&oacute;n)</B> permite
acceder al grupo de documentaci&oacute;n en l&iacute;nea de AFS que se suministra con AFS
para Windows.
<DD><P>El subgrupo de programas <B>Cliente</B> permite a los usuarios acceder
al recuadro de propiedades de AFS Client y a la ayuda en l&iacute;nea de AFS
Client.
</DL>
</LI><LI>A&ntilde;ade el Men&uacute; de AFS al men&uacute; de contexto del Explorador de Windows
NT.
</LI><LI>Crea un directorio de documentaci&oacute;n y coloca los documentos en l&iacute;nea
<I>IBM AFS para Windows Gu&iacute;a de iniciaci&oacute;n r&aacute;pida</I> e <I>IBM AFS for
Windows Release Notes</I> en dicho directorio, que se encuentra en
<B>\Archivos de programa\Ibm\Afs\Documentation</B>.
</LI><LI>A&ntilde;ade <B>Credenciales de AFS</B> al grupo de programas de
<B>Inicio</B>. El icono <B>AFS Client</B> aparece en la barra
de tareas al arrancar.
</LI><LI>Crea los directorios de instalaci&oacute;n en los que el programa de
configuraci&oacute;n instala los binarios, iconos y archivos de ayuda de AFS.
Los directorios por omisi&oacute;n son <B>\Archivos de
programa\Ibm\Afs\Client\Program</B> y <B>\Archivos de
programa\Ibm\Afs\Common</B>.
</LI><LI>Registra el AFS Client como un servicio.
</LI><LI>Instala el programa de utilidad Configuraci&oacute;n de AFS Client y a&ntilde;ade el
icono <B>Configuraci&oacute;n de AFS Client</B> al Panel de control, colocando el
archivo <B>afs_cpa.cpl</B> en el directorio
<B>\</B><I>Omisi&oacute;nWindows</I><B>\system32</B>, donde
<I>Omisi&oacute;nWindows</I> es el directorio de Windows.
</LI><LI>Coloca el archivo <B>afsdcell.ini</B> en el directorio de
Windows y en el directorio <B>\Archivos de
programa\Ibm\Afs\Common</B>. Si ha realizado una actualizaci&oacute;n a
partir de una versi&oacute;n anterior del AFS Client, la base de datos de c&eacute;lulas de
AFS Client (<B>afsdcell.ini</B>) del directorio de Windows no se
sustituye.
</LI><LI>Modifica el Registro de Windows NT a&ntilde;adiendo entradas correspondientes al
AFS Client.
</LI></UL>
<P><H4><A NAME="Header_13">Cambios efectuados en el sistema al instalar AFS Light</A></H4>
<P>El proceso de instalaci&oacute;n de AFS Light para Windows 95 y Windows 98
efect&uacute;a los siguientes cambios en el sistema:
<UL>
<LI>Crea un grupo de programas denominado <B>IBM AFS</B> con las
siguientes aplicaciones de programa:
<DL>
<DD><P>La entrada de programa <B>Documentation (Documentaci&oacute;n)</B> permite
acceder al grupo de documentaci&oacute;n en l&iacute;nea de AFS que se suministra con AFS
para Windows.
<DD><P>El subgrupo de programas <B>Light</B> permite a los usuarios acceder
al recuadro de propiedades de AFS Light y a la ayuda en l&iacute;nea de AFS
Light.
</DL>
</LI><LI>A&ntilde;ade el Men&uacute; de AFS al men&uacute; de contexto del Explorador de Windows.
</LI><LI>Crea un directorio de documentaci&oacute;n y coloca los documentos en l&iacute;nea
<I>IBM AFS para Windows Gu&iacute;a de iniciaci&oacute;n r&aacute;pida</I> e <I>IBM AFS for
Windows Release Notes</I> en dicho directorio, que se encuentra en
<B>\Archivos de programa\Ibm\Afs\Documentation</B>.
</LI><LI>Crea los directorios de instalaci&oacute;n en los que el programa de
configuraci&oacute;n instala los binarios, iconos y archivos de ayuda de AFS.
Los directorios por omisi&oacute;n son <B>\Archivos de
programa\Ibm\Afs\Client\Program</B> y <B>\Archivos de
programa\Ibm\Afs\Common</B>.
</LI><LI>Instala el programa de utilidad Configuraci&oacute;n de AFS Light y a&ntilde;ade el
icono <B>Configuraci&oacute;n de AFS Light</B> al Panel de control, colocando el
archivo <B>afs_cpa.cpl</B> en el directorio
<B>\</B><I>Omisi&oacute;nWindows</I><B>\system</B>, donde
<I>Omisi&oacute;nWindows</I> es el directorio de Windows.
</LI><LI>Coloca el archivo <B>afsdcell.ini</B> en el directorio de
Windows y en el directorio <B>\Archivos de
programa\Ibm\Afs\Common</B>.
</LI><LI>Modifica el Registro de Windows, a&ntilde;adiendo entradas correspondientes a AFS
Light.
</LI></UL>
<P><H4><A NAME="Header_14">Cambios efectuados en el sistema al instalar el AFS Server</A></H4>
<P>El proceso de instalaci&oacute;n del AFS Server para Windows NT efect&uacute;a los
siguientes cambios en el sistema:
<UL>
<LI>Crea un grupo de programas en el men&uacute; <B>Inicio</B> denominado
<B>IBM AFS</B> con las siguientes aplicaciones:
<DL>
<DD><P>La entrada de programa <B>Documentation (Documentaci&oacute;n)</B> permite
acceder al grupo de documentaci&oacute;n en l&iacute;nea de AFS que se suministra con AFS
para Windows.
<DD><P>El subgrupo de programas <B>Servidor</B> permite a los usuarios
acceder al Asistente de inicio r&aacute;pido de AFS Server.
</DL>
</LI><LI>Crea un directorio de documentaci&oacute;n y coloca los documentos en l&iacute;nea
<I>IBM AFS para Windows Gu&iacute;a de iniciaci&oacute;n r&aacute;pida</I> e <I>IBM AFS for
Windows Release Notes</I> en dicho directorio, que se encuentra en
<B>\Archivos de programa\Ibm\Afs\Documentation</B>.
</LI><LI>Crea los directorios de instalaci&oacute;n en los que el programa de
configuraci&oacute;n instala los binarios, iconos y archivos de ayuda de AFS.
Los directorios por omisi&oacute;n son <B>\Archivos de
programa\Ibm\Afs\Server\usr\afs\bin</B> y <B>\Archivos de
programa\Ibm\Afs\Common</B>.
</LI><LI>Registra el AFS Server como un servicio.
</LI><LI>Instala la aplicaci&oacute;n Configuraci&oacute;n de AFS Server y a&ntilde;ade el icono
<B>Configuraci&oacute;n de AFS Server</B> al Panel de control, colocando el
archivo <B>afsserver.cpl</B> en el directorio
<B>\</B><I>Omisi&oacute;nWindows</I><B>\system32</B>, donde
<I>Omisi&oacute;nWindows</I> es el directorio de Windows.
</LI><LI>Modifica el Registro de Windows NT a&ntilde;adiendo entradas correspondientes al
AFS Server.
</LI></UL>
<P><H4><A NAME="Header_15">Cambios efectuados en el sistema al instalar el AFS Control Center</A></H4>
<P>El proceso de instalaci&oacute;n del AFS Control Center para Windows NT
efect&uacute;a los siguientes cambios en el sistema:
<UL>
<LI>Crea un grupo de programas en el men&uacute; <B>Inicio</B> denominado
<B>IBM AFS</B> con las siguientes aplicaciones:
<DL>
<DD><P>La entrada de programa <B>Documentation (Documentaci&oacute;n)</B> permite
acceder al grupo de documentaci&oacute;n en l&iacute;nea de AFS que se suministra con AFS
para Windows.
<DD><P>El subgrupo de programas <B>Control Center</B> permite a los usuarios
acceder al Account Manager y al Server Manager.
</DL>
</LI><LI>Crea un directorio de documentaci&oacute;n y coloca los documentos en l&iacute;nea
<I>IBM AFS para Windows Gu&iacute;a de iniciaci&oacute;n r&aacute;pida</I> e <I>IBM AFS for
Windows Release Notes</I> en dicho directorio, que se encuentra en
<B>\Archivos de programa\Ibm\Afs\Documentation</B>.
</LI><LI>Crea los directorios de instalaci&oacute;n en los que el programa de
configuraci&oacute;n instala los binarios, iconos y archivos de ayuda de AFS.
Los directorios por omisi&oacute;n son <B>\Archivos de programa\Ibm\Afs\Control
Center</B> y <B>\Archivos de programa\Ibm\Afs\Common</B>.
</LI><LI>Instala el programa de utilidad Propiedades de AFS Control Center y a&ntilde;ade
el icono <B>AFS Control Center</B> al Panel de control, colocando el
archivo <B>afs_cpa.cpl</B> en el directorio
<B>\</B><I>Omisi&oacute;nWindows</I><B>\system32</B>, donde
<I>Omisi&oacute;nWindows</I> es el directorio de Windows. El icono s&oacute;lo se
a&ntilde;ade al Panel de control si se instala el AFS Control Center en el
sistema.
</LI><LI>Coloca el archivo <B>afsdcell.ini</B> en el directorio de
Windows y en el directorio <B>\Archivos de
programa\Ibm\Afs\Common</B>.
</LI><LI>Modifica el Registro de Windows NT a&ntilde;adiendo entradas correspondientes al
AFS Control Center.
</LI></UL>
<P><H4><A NAME="Header_16">Cambios efectuados en el sistema al instalar la AFS Supplemental Documentation</A></H4>
<P>El proceso de instalaci&oacute;n de la AFS Supplemental Documentation efect&uacute;a
los siguientes cambios en el sistema:
<UL>
<LI>Crea un grupo de programas en el men&uacute; <B>Inicio</B> denominado
<B>IBM AFS</B> con una entrada de programa denominada <B>Documentation
(Documentaci&oacute;n)</B>.
</LI><LI>Se instalan en la m&aacute;quina los siguientes documentos de administraci&oacute;n del
sistema: <I>IBM AFS Administration Guide</I> e <I>IBM AFS
Administration Reference</I>. Estos documentos se a&ntilde;aden al
directorio de documentaci&oacute;n en l&iacute;nea, que se encuentra en <B>\Archivos de
programa\Ibm\Afs\Documentation</B>. Los documentos en l&iacute;nea <I>IBM
AFS para Windows Gu&iacute;a de iniciaci&oacute;n r&aacute;pida</I> e <I>IBM AFS for Windows
Release Notes</I> tambi&eacute;n se instalan en el directorio de
documentaci&oacute;n.
</LI><LI>Modifica el Registro de Windows NT a&ntilde;adiendo entradas correspondientes a
la AFS Supplemental Documentation.
</LI></UL>
<HR><H2><A NAME="HDRDOCUMENT" HREF="awqbg002.htm#ToC_17">Documentaci&oacute;n de AFS para Windows</A></H2>
<P>Esta secci&oacute;n describe la documentaci&oacute;n que se suministra con AFS para
Windows y detalla los procedimientos a seguir para acceder a dicha
documentaci&oacute;n.
<P><H3><A NAME="Header_18" HREF="awqbg002.htm#ToC_18">El directorio de documentaci&oacute;n en l&iacute;nea</A></H3>
<A NAME="IDX215"></A>
<A NAME="IDX216"></A>
<P>Independientemente de los componentes que instale en el sistema, se crea un
directorio de documentaci&oacute;n. Su ubicaci&oacute;n por omisi&oacute;n es <B>\Archivos
de programa\Ibm\Afs\Documentation</B>. Este directorio incluye
<I>IBM AFS para Windows Gu&iacute;a de iniciaci&oacute;n r&aacute;pida</I> e <I>IBM AFS for
Windows Release Notes</I>. Estos mismos documentos est&aacute;n disponibles
en el &iacute;ndice de Documentaci&oacute;n, al que se accede desde la entrada
<B>Documentation (Documentaci&oacute;n)</B> del men&uacute; <B>Inicio</B>.
<P>Si instala la AFS Supplemental Documentation, el directorio de
documentaci&oacute;n incluye tambi&eacute;n los siguientes documentos: <I>IBM AFS
Administration Guide</I> e <I>IBM AFS Administration
Reference</I>. Estos mismos documentos est&aacute;n disponibles en el &iacute;ndice
de Documentaci&oacute;n, al que se accede desde la entrada <B>Documentation
(Documentaci&oacute;n)</B> del men&uacute; <B>Inicio</B>.
<P><H4><A NAME="Header_19">Para acceder al directorio de documentaci&oacute;n en l&iacute;nea:</A></H4>
<OL TYPE=1>
<LI>En el men&uacute; <B>Inicio</B>, seleccione <B>Programas</B>, luego
<B>IBM AFS</B> y luego <B>Documentation (Documentaci&oacute;n)</B>.
</LI><LI>Seleccione el documento que desee ver.
</LI></OL>
<P><H3><A NAME="Header_20" HREF="awqbg002.htm#ToC_20">El directorio de documentaci&oacute;n del CD-ROM</A></H3>
<A NAME="IDX217"></A>
<A NAME="IDX218"></A>
<P>El CD-ROM de AFS para Windows contiene un directorio de
documentaci&oacute;n. Este directorio incluye la siguiente
documentaci&oacute;n: <I>IBM AFS para Windows Gu&iacute;a de iniciaci&oacute;n
r&aacute;pida</I>, <I>IBM AFS for Windows Release Notes</I>, <I>IBM AFS
Administration Guide</I> e <I>IBM AFS Administration
Reference</I>. La documentaci&oacute;n se ofrece en los formatos HTML y
PDF.
<P><H4><A NAME="Header_21">Para acceder al directorio de documentaci&oacute;n del CD-ROM:</A></H4>
<OL TYPE=1>
<LI>Inserte el CD-ROM de AFS para Windows en la unidad de CD-ROM de la
m&aacute;quina.
</LI><LI>Vaya a una de las siguientes v&iacute;as de acceso. Tenga en cuenta que
<I>CD</I> es la letra de su unidad de CD-ROM.
<UL>
<LI>Para la documentaci&oacute;n en HTML, vaya a la v&iacute;a de acceso
<I>CD</I><B>:\Documentation\Html</B>.
</LI><LI>Para la documentaci&oacute;n en PDF, vaya a la v&iacute;a de acceso
<I>CD</I><B>:\Documentation\Pdf</B>.
</LI></UL>
</LI></OL>
<P><H3><A NAME="Header_22" HREF="awqbg002.htm#ToC_22">Ayuda en l&iacute;nea</A></H3>
<A NAME="IDX219"></A>
<A NAME="IDX220"></A>
<P>Se instala ayuda en l&iacute;nea junto con cada uno de los componentes de AFS para
Windows. La documentaci&oacute;n de ayuda en l&iacute;nea describe las funciones
disponibles para cada componente. Utilice los men&uacute;s de <B>Ayuda</B>
y los botones de <B>Ayuda</B> situados en la mayor&iacute;a de los recuadros de
di&aacute;logo para acceder a la ayuda en l&iacute;nea. Puede obtener ayuda sobre
temas examinando la p&aacute;gina de contenido, utilizando el &iacute;ndice para localizar
temas y utilizando <B>Buscar</B>, el sistema de b&uacute;squeda de la ayuda en
l&iacute;nea.
<HR><H2><A NAME="HDRCONFIGURE" HREF="awqbg002.htm#ToC_23">Configuraci&oacute;n de AFS para Windows</A></H2>
<P>
<A NAME="IDX221"></A>
<A NAME="IDX222"></A>
Esta secci&oacute;n describe el procedimiento de configuraci&oacute;n para cada uno de los
componentes de AFS para Windows. Debe configurar los componentes del
sistema antes de utilizar AFS.
<P><H3><A NAME="HDRCLIENT_CONFIG" HREF="awqbg002.htm#ToC_24">Para configurar el AFS Client</A></H3>
<A NAME="IDX223"></A>
<A NAME="IDX224"></A>
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Nota:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">Si tiene intenci&oacute;n de configurar el AFS Server en su sistema Windows NT, no
es necesario que configure el AFS Client. El AFS Client se configura
autom&aacute;ticamente cuando se configura el AFS Server. Adem&aacute;s, si ha
realizado una actualizaci&oacute;n a esta versi&oacute;n de AFS para Windows a partir de un
AFS Client de una versi&oacute;n anterior, la informaci&oacute;n de configuraci&oacute;n se
conserva. No es necesario que vuelva a configurar el AFS Client.
</TD></TR></TABLE>
<OL TYPE=1>
<LI>En el men&uacute; <B>Inicio</B>, seleccione <B>Configuraci&oacute;n</B> y luego
<B>Panel de control</B>.
</LI><LI>Efect&uacute;e una doble pulsaci&oacute;n sobre el icono <B>Configuraci&oacute;n de AFS
Client</B>. Se abrir&aacute; el programa de utilidad Configuraci&oacute;n de AFS
Client, por la pesta&ntilde;a <B>General</B>.
</LI><LI>En el recuadro <B>Nombre de c&eacute;lula</B>, especifique el nombre de la
c&eacute;lula de AFS en la que la m&aacute;quina va a ser cliente.
</LI><LI>Seleccione la pesta&ntilde;a <B>C&eacute;lulas de AFS</B>. Si la c&eacute;lula en la
que la m&aacute;quina va a ser cliente no aparece en la lista de c&eacute;lulas de AFS,
seleccione el bot&oacute;n <B>A&ntilde;adir</B>. Aparecer&aacute; el recuadro de di&aacute;logo
C&eacute;lula nueva. Especifique el nombre de la c&eacute;lula en el recuadro
<B>C&eacute;lula de AFS</B> y una breve descripci&oacute;n en el recuadro
<B>Descripci&oacute;n</B>. 
<P>Seleccione el bot&oacute;n <B>A&ntilde;adir</B>. Aparecer&aacute; el recuadro de
di&aacute;logo A&ntilde;adir servidor. En el recuadro <B>Nombre de servidor</B>,
especifique el nombre de un Servidor de ubicaci&oacute;n de volumen de la c&eacute;lula
seleccionada. Seleccione <B>Aceptar</B> para cerrar el recuadro de
di&aacute;logo A&ntilde;adir servidor. Repita este proceso para a&ntilde;adir informaci&oacute;n
correspondiente a todos los Servidores de ubicaci&oacute;n de volumen de la
c&eacute;lula. (Si no sabe los nombres de los Servidores de ubicaci&oacute;n de
volumen de la c&eacute;lula de AFS, p&oacute;ngase en contacto con el administrador del
sistema AFS). Una vez haya especificado informaci&oacute;n correspondiente a
todos los servidores, seleccione <B>Aceptar</B> para cerrar el recuadro de
di&aacute;logo C&eacute;lula nueva.
</LI><LI>Seleccione la pesta&ntilde;a <B>General</B> y seleccione el bot&oacute;n
<B>Iniciar servicio</B> para iniciar el servicio de AFS Client.
</LI><LI>Seleccione la pesta&ntilde;a <B>Letras de unidad</B>. Para asignar una
letra de unidad de la m&aacute;quina Windows NT al espacio de archivos de AFS,
seleccione el bot&oacute;n <B>A&ntilde;adir</B>. Aparecer&aacute; el recuadro de di&aacute;logo
Asignar letra de unidad.
</LI><LI>En el recuadro <B>Letra de unidad</B>, seleccione la unidad que desea
asignar al espacio de archivos de AFS o acepte el valor por omisi&oacute;n. En
el recuadro <B>V&iacute;a de acceso</B> <B>de AFS</B>, indique la ubicaci&oacute;n
de AFS a la que desea asignar la unidad seleccionada, por ejemplo <B>
/afs</B>. Si lo desea, entre una descripci&oacute;n de la asignaci&oacute;n de
unidad de AFS en el recuadro <B>Descripci&oacute;n</B>. Seleccione
<B>Aceptar</B> para conectar la unidad al lugar especificado del espacio
de archivos de AFS.
</LI><LI>Seleccione <B>Aceptar</B> para cerrar el programa de utilidad
Configuraci&oacute;n de AFS Client. 
<P>Ahora el AFS Client est&aacute; configurado en la c&eacute;lula de AFS seleccionada y se
puede acceder al espacio de archivos de AFS mediante la asignaci&oacute;n de unidad
seleccionada en el Explorador de Windows NT.
</LI></OL>
<P><H3><A NAME="HDRGATEWAY" HREF="awqbg002.htm#ToC_25">Para configurar el AFS Client como una Pasarela de AFS Light</A></H3>
<A NAME="IDX225"></A>
<A NAME="IDX226"></A>
<A NAME="IDX227"></A>
<P>Puede configurar el AFS Client en su m&aacute;quina Windows NT para que act&uacute;e como
una Pasarela de AFS Light. Su AFS Client, configurado como una Pasarela
de AFS Light, permite a los usuarios de AFS Light acceder al espacio de
archivos de AFS.
<OL TYPE=1>
<LI>Configure el AFS Client tal como se describe en el apartado <A HREF="#HDRCLIENT_CONFIG">Para configurar el AFS Client</A>.
</LI><LI>En el men&uacute; <B>Inicio</B>, seleccione <B>Configuraci&oacute;n</B> y luego
<B>Panel de control</B>.
</LI><LI>Efect&uacute;e una doble pulsaci&oacute;n sobre el icono <B>Configuraci&oacute;n de AFS
Client</B>. Se abrir&aacute; el programa de utilidad Configuraci&oacute;n de AFS
Client, por la pesta&ntilde;a <B>General</B>.
</LI><LI>Seleccione la opci&oacute;n <B>Proporcionar una Pasarela de AFS
Light</B>.
</LI><LI>Seleccione <B>Aceptar</B>. 
<UL>
<LI>Si el servicio de AFS Client se est&aacute; ejecutando, aparecer&aacute; un recuadro de
mensaje que le informa de que debe volver a iniciar el servicio.
Seleccione <B>S&iacute;</B> para volver a iniciar el servicio de AFS Client y
habilitar la Pasarela de AFS Light.
</LI><LI>Si el servicio de AFS Client est&aacute; detenido, aparecer&aacute; un recuadro de
mensaje que le informa de que debe iniciar el servicio de AFS Client.
Seleccione <B>S&iacute;</B> para iniciar el servicio de AFS Client y habilitar la
Pasarela de AFS Light.
</LI></UL>
</LI><LI>
<A NAME="IDX228"></A>
A&ntilde;ada entradas de c&eacute;lulas a la base de datos de c&eacute;lulas de Pasarela de AFS
Light. Tenga en cuenta que, para que un usuario de AFS Light pueda
acceder a una c&eacute;lula, debe existir una entrada correspondiente a la c&eacute;lula en
la base de datos de c&eacute;lulas de AFS Light y en la base de datos de c&eacute;lulas de
Pasarela de AFS Light. Si la informaci&oacute;n es incorrecta o falta
informaci&oacute;n sobre una c&eacute;lula en la base de datos de c&eacute;lulas de la m&aacute;quina
pasarela, las m&aacute;quinas Light Client no podr&aacute;n acceder a los archivos. 
<P><B>Para a&ntilde;adir una entrada a la base de datos de c&eacute;lulas:</B>
<P>Acceda a la pesta&ntilde;a <B>C&eacute;lula de AFS</B> desde el programa de utilidad
Configuraci&oacute;n de AFS Light y seleccione el bot&oacute;n <B>A&ntilde;adir</B>.
Aparecer&aacute; el recuadro de di&aacute;logo C&eacute;lula nueva. Especifique el nombre de
la c&eacute;lula en el recuadro <B>C&eacute;lula de AFS</B> y una breve descripci&oacute;n en
el recuadro <B>Descripci&oacute;n</B>.
<P>Seleccione el bot&oacute;n <B>A&ntilde;adir</B>. Aparecer&aacute; el recuadro de
di&aacute;logo A&ntilde;adir servidor. En el recuadro <B>Nombre de servidor</B>,
especifique el nombre de un Servidor de ubicaci&oacute;n de volumen de la c&eacute;lula
seleccionada. Seleccione <B>Aceptar</B> para cerrar el recuadro de
di&aacute;logo A&ntilde;adir servidor. Repita este proceso para a&ntilde;adir informaci&oacute;n
correspondiente a todos los Servidores de ubicaci&oacute;n de volumen de la
c&eacute;lula. (Si no sabe los nombres de los Servidores de ubicaci&oacute;n de
volumen de la c&eacute;lula de AFS, p&oacute;ngase en contacto con el administrador del
sistema AFS). Una vez haya especificado informaci&oacute;n correspondiente a
todos los servidores, seleccione <B>Aceptar</B> para cerrar el recuadro de
di&aacute;logo C&eacute;lula nueva.
</LI></OL>
<P>
<A NAME="IDX229"></A>
<A NAME="IDX230"></A>
<A NAME="IDX231"></A>
Ahora la m&aacute;quina Windows NT est&aacute; configurada como una Pasarela de AFS
Light. Una vez configurada como una Pasarela de AFS Light, su m&aacute;quina
AFS Client debe ser capaz de autentificar usuarios de AFS Light en un contexto
de Windows. Esta autentificaci&oacute;n se puede realizar mediante una cuenta
de usuario de <I>dominio</I> o mediante cuentas de usuario de
<I>m&aacute;quina</I> sincronizadas. Una cuenta de usuario de dominio es
una cuenta de usuario de un dominio Windows. Una cuenta de usuario de
m&aacute;quina es una cuenta de usuario que s&oacute;lo es v&aacute;lida en una determinada m&aacute;quina
sistema principal.
<P>Cuando se configura una Pasarela de AFS Light en un dominio de Windows, el
usuario de AFS Light debe iniciar una sesi&oacute;n en una cuenta de usuario de
dominio del dominio al que pertenece la pasarela o en una cuenta de usuario de
m&aacute;quina con el mismo nombre de usuario y contrase&ntilde;a que los utilizados en una
cuenta de usuario de dominio del dominio de la pasarela.
<P>Si se utilizan cuentas de usuario de m&aacute;quina, dichas cuentas deben estar
sincronizadas en las m&aacute;quinas Pasarela de AFS Light y AFS Light. Un
usuario debe iniciar una sesi&oacute;n en una m&aacute;quina AFS Light con el mismo nombre
de usuario y contrase&ntilde;a que los utilizados en una cuenta de usuario de m&aacute;quina
definida en la m&aacute;quina Pasarela de AFS Light.
<P><H3><A NAME="Header_26" HREF="awqbg002.htm#ToC_26">Para configurar AFS Light</A></H3>
<A NAME="IDX232"></A>
<A NAME="IDX233"></A>
<P>AFS Light accede al espacio de archivos de AFS mediante una Pasarela de AFS
Light. Antes de configurar AFS Light, debe tener una m&aacute;quina Windows NT
ejecutando el AFS Client y configurada como una Pasarela de AFS Light.
Consulte el apartado <A HREF="#HDRGATEWAY">Para configurar el AFS Client como una Pasarela de AFS Light</A> para obtener m&aacute;s informaci&oacute;n.
<OL TYPE=1>
<LI>En el men&uacute; <B>Inicio</B>, seleccione <B>Configuraci&oacute;n</B> y luego
<B>Panel de control</B>.
</LI><LI>Efect&uacute;e una doble pulsaci&oacute;n en el icono <B>Configuraci&oacute;n de AFS
Light</B>. Se abrir&aacute; el programa de utilidad Configuraci&oacute;n de AFS
Light, por la pesta&ntilde;a <B>General</B>.
<A NAME="IDX234"></A>
<A NAME="IDX235"></A>
</LI><LI>En el recuadro <B>Pasarela</B>, especifique el nombre de una m&aacute;quina
Windows NT configurada como una Pasarela de AFS Light y pulse <B>Conectar
ahora</B>. El nombre de la m&aacute;quina pasarela es el nombre del servicio
NetBIOS de la pasarela, en el formato <I>m&aacute;q</I><B>-afs</B>,
donde <I>m&aacute;q</I> es el nombre de la m&aacute;quina sistema principal, que puede
tener un m&aacute;ximo de 11 caracteres. AFS Light debe ser capaz de resolver
este nombre de servicio para poderse comunicar con la m&aacute;quina pasarela.
La resoluci&oacute;n de nombres se puede conseguir a&ntilde;adiendo el nombre del servicio
NetBIOS de la pasarela al archivo LMHOSTS del cliente o a los servidores DNS o
WINS adecuados. Si la m&aacute;quina AFS Light y la m&aacute;quina Pasarela de AFS
Light residen en la misma subred, no se necesita ninguna configuraci&oacute;n
adicional.
<P>AFS Light pasa a ser autom&aacute;ticamente miembro de la misma c&eacute;lula que su
Pasarela de AFS Light. El nombre de la c&eacute;lula se muestra en el recuadro
<B>Nombre de c&eacute;lula</B>.
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Nota:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">Si la m&aacute;quina Pasarela de AFS Light est&aacute; en el mismo dominio que la m&aacute;quina
AFS Light y el nombre de sistema principal de la m&aacute;quina pasarela de este
dominio es <B>xyz-pc</B>, puede especificar como nombre de la m&aacute;quina en
el recuadro <B>pasarela</B> el valor <B>xyz-pc</B> o el valor
<B>xyz-pc.xcompany.com</B>.
</TD></TR></TABLE>
</LI><LI>Seleccione la pesta&ntilde;a <B>C&eacute;lulas de AFS</B>. Si la c&eacute;lula a la
que pertenece la m&aacute;quina no aparece en la lista de c&eacute;lulas de AFS, seleccione
el bot&oacute;n <B>A&ntilde;adir</B>. Aparecer&aacute; el recuadro de di&aacute;logo C&eacute;lula
nueva. Especifique el nombre de la c&eacute;lula en el recuadro <B>C&eacute;lula de
AFS</B> y una breve descripci&oacute;n en el recuadro
<B>Descripci&oacute;n</B>. 
<P>Seleccione el bot&oacute;n <B>A&ntilde;adir</B>. Aparecer&aacute; el recuadro de
di&aacute;logo A&ntilde;adir servidor. En el recuadro <B>Nombre de servidor</B>,
especifique el nombre de un Servidor de ubicaci&oacute;n de volumen de la c&eacute;lula
seleccionada. Seleccione <B>Aceptar</B> para cerrar el recuadro de
di&aacute;logo A&ntilde;adir servidor. Repita este proceso para a&ntilde;adir informaci&oacute;n
correspondiente a todos los Servidores de ubicaci&oacute;n de volumen de la
c&eacute;lula. (Si no sabe los nombres de los Servidores de ubicaci&oacute;n de
volumen de la c&eacute;lula de AFS, p&oacute;ngase en contacto con el administrador del
sistema AFS). Una vez haya especificado informaci&oacute;n correspondiente a
todos los servidores, seleccione <B>Aceptar</B> para cerrar el recuadro de
di&aacute;logo C&eacute;lula nueva.
<P>Tenga en cuenta que debe existir una entrada id&eacute;ntica en la base de datos
de c&eacute;lulas de Pasarela de AFS Light (archivo <B>afsdcell.ini</B>)
para que el usuario de AFS Light se pueda autentificar ante la c&eacute;lula.
Consulte el apartado <A HREF="#HDRGATEWAY">Para configurar el AFS Client como una Pasarela de AFS Light</A> para obtener m&aacute;s informaci&oacute;n sobre c&oacute;mo sincronizar la base
de datos de c&eacute;lulas de la m&aacute;quina pasarela con la base de datos de c&eacute;lulas de
su Light Client.
</LI><LI>Seleccione la pesta&ntilde;a <B>Letras de unidad</B>. Para asignar una
letra de unidad de la m&aacute;quina Windows al espacio de archivos de AFS,
seleccione el bot&oacute;n <B>A&ntilde;adir</B>. Aparecer&aacute; el recuadro de di&aacute;logo
Asignar letra de unidad.
</LI><LI>En el recuadro <B>Letra de unidad</B>, seleccione la unidad que desea
asignar al espacio de archivos de AFS o acepte el valor por omisi&oacute;n. En
el recuadro <B>V&iacute;a de acceso</B> <B>de AFS</B>, indique la ubicaci&oacute;n
de AFS a la que desea asignar la unidad seleccionada, por ejemplo <B>
/afs</B>. Si lo desea, entre una descripci&oacute;n de la asignaci&oacute;n de
unidad de AFS en el recuadro <B>Descripci&oacute;n</B>. Seleccione
<B>Aceptar</B> para conectar la unidad al lugar especificado del espacio
de archivos de AFS.
</LI><LI>Seleccione <B>Aceptar</B> para cerrar el programa de utilidad
Configuraci&oacute;n de AFS Light. 
<P>Ahora AFS Light est&aacute; configurado en la c&eacute;lula de AFS especificada y se
puede acceder al espacio de archivos de AFS mediante la asignaci&oacute;n de unidad
desde el Explorador de Windows.
</LI></OL>
<P><H3><A NAME="Header_27" HREF="awqbg002.htm#ToC_27">Para configurar el AFS Server</A></H3>
<A NAME="IDX236"></A>
<A NAME="IDX237"></A>
<P>El proceso de configuraci&oacute;n inicia los servicios necesarios para ejecutar
el AFS Server y define particiones de AFS en su m&aacute;quina Windows NT.
Mediante el Asistente de configuraci&oacute;n de AFS puede configurar r&aacute;pidamente el
AFS Server como el primer servidor de una nueva c&eacute;lula de AFS o como un
servidor de una c&eacute;lula de AFS existente. Tenga en cuenta que si ha
realizado una actualizaci&oacute;n a esta versi&oacute;n del AFS Server, la informaci&oacute;n de
configuraci&oacute;n de la versi&oacute;n anterior se conserva; no tiene que volver a
configurar el servidor.
<P><B>
<A NAME="IDX238"></A>
Para configurar el AFS Server como el primer AFS Server de una
c&eacute;lula:</B>
<OL TYPE=1>
<LI>En el men&uacute; <B>Inicio</B>, seleccione <B>Programas</B>, luego
<B>IBM AFS</B>, luego <B>Servidor</B> y luego <B>Asistente de
configuraci&oacute;n</B>. Se abrir&aacute; el Asistente de inicio r&aacute;pido de AFS
Server.
</LI><LI>Seleccione el bot&oacute;n <B>Siguiente</B>. Aparecer&aacute; el recuadro de
di&aacute;logo Informaci&oacute;n de c&eacute;lula y servidor.
</LI><LI>Seleccione la opci&oacute;n <B>Este ser&aacute; el primer servidor de una c&eacute;lula de
AFS nueva</B>.
</LI><LI>En el recuadro <B>Nombre de c&eacute;lula</B>, especifique un nombre para la
nueva c&eacute;lula de AFS. 
<P>El formato de un nombre de un dominio de Internet que se pueda utilizar
como nombre de una c&eacute;lula de AFS debe cumplir las siguientes
condiciones:
<UL>
<LI>El nombre de c&eacute;lula debe ser exclusivo para poder distinguir su c&eacute;lula de
AFS de las dem&aacute;s c&eacute;lulas del espacio de nombres global de AFS.
</LI><LI>El nombre de c&eacute;lula puede contener un m&aacute;ximo de 64 caracteres, pero se
recomienda utilizar menos.
</LI><LI>El nombre de c&eacute;lula s&oacute;lo puede incluir caracteres en min&uacute;sculas, n&uacute;meros,
s&iacute;mbolos de subrayado, guiones y puntos para asegurar su portabilidad entre
distintos tipos de sistemas operativos.
</LI><LI>El nombre de c&eacute;lula puede incluir cualquier n&uacute;mero o letra, que se
separan, por convenio, mediante puntos.
</LI><LI>El nombre de c&eacute;lula debe terminar por un sufijo que indique el tipo de
instituci&oacute;n a la que pertenece. Algunos de los sufijos est&aacute;ndares son
<B>.com</B>, para empresas y otras organizaciones comerciales,
<B>.edu</B>, para instituciones educativas, como universidades,
<B>.gov</B>, para instituciones gubernamentales y
<B>.mil</B>, para instituciones militares.
</LI></UL>
</LI><LI>En el recuadro <B>Contrase&ntilde;a</B>, especifique la serie de caracteres
que servir&aacute; como contrase&ntilde;a para la cuenta del principal de AFS Server de la
c&eacute;lula (<B>afs</B>). Todos los AFS Server obtienen se&ntilde;ales de AFS
como este principal, y el m&oacute;dulo Ticket Granting Service (TGS) del Servidor de
autentificaci&oacute;n utiliza esta contrase&ntilde;a para cifrar los detalles del servidor
que los AFS Client presentan a los servidores durante la autentificaci&oacute;n
mutua.
</LI><LI>En el recuadro <B>Verificar contrase&ntilde;a</B>, vuelva a escribir la
contrase&ntilde;a inicial de AFS, correspondiente a la cuenta de principal de AFS
Server para esta c&eacute;lula, para confirmar la selecci&oacute;n de contrase&ntilde;a.
</LI><LI>Seleccione el bot&oacute;n <B>Siguiente</B>. Aparecer&aacute; el recuadro de
di&aacute;logo Informaci&oacute;n administrativa.
</LI><LI>En el recuadro <B>Nombre</B>, especifique un nombre de usuario que
servir&aacute; como cuenta administrativa gen&eacute;rica de AFS para esta c&eacute;lula
(generalmente, <B>admin</B>).
<P>
<A NAME="IDX239"></A>
La utilizaci&oacute;n de una cuenta administrativa gen&eacute;rica significa que no tiene
que otorgar privilegios a cada administrador del sistema. En su lugar,
cada administrador conoce el nombre y la contrase&ntilde;a de esta cuenta
administrativa gen&eacute;rica y utiliza esta identidad para autentificarse ante AFS
cuando realiza tareas que necesitan privilegios de administraci&oacute;n.
</LI><LI>En el recuadro <B>Contrase&ntilde;a</B>, especifique una serie de caracteres
que servir&aacute; como la contrase&ntilde;a de la cuenta administrativa de AFS.
</LI><LI>En el recuadro <B>Verificar contrase&ntilde;a</B>, vuelva a escribir la
contrase&ntilde;a de la cuenta administrativa de AFS para confirmar la selecci&oacute;n de
la contrase&ntilde;a.
</LI><LI>Especifique el ID de usuario (UID) de AFS a asignar a la cuenta
administrativa de AFS:
<UL>
<LI>(Recomendado) Para asignar autom&aacute;ticamente el siguiente UID disponible a
la cuenta administrativa de AFS, seleccione la opci&oacute;n <B>Utilizar el
siguiente UID de AFS disponible</B>.
</LI><LI>Para asignar un determinado UID a la cuenta administrativa de AFS,
seleccione la opci&oacute;n <B>Utilizar este ID de AFS</B> y entre el UID que
desee en el recuadro de entrada.
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Nota:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">En general no se recomienda asignar un determinado UID a una nueva cuenta de
AFS, a no ser que el UID de AFS deba coincidir con un UID de UNIX
existente.
</TD></TR></TABLE>
</LI></UL>
</LI><LI>Seleccione el bot&oacute;n <B>Siguiente</B>. Aparecer&aacute; el recuadro de
di&aacute;logo Servicio de archivos.
<P>
<A NAME="IDX240"></A>
Los Servidores de archivos de AFS ofrecen los datos y archivos solicitados del
servidor a los AFS Client. Los Servidores de archivos guardan archivos
y datos, manejan solicitudes para copiar, mover, crear y suprimir archivos y
directorios y efect&uacute;an un seguimiento de la informaci&oacute;n de estado sobre cada
archivo y directorio del servidor.
<P>Puesto que est&aacute; configurando el primer AFS Server de una c&eacute;lula nueva, el
Servicio de archivos debe estar configurado en el servidor, y se configurar&aacute;
autom&aacute;ticamente.
</LI><LI>Seleccione el bot&oacute;n <B>Siguiente</B>. Aparecer&aacute; el recuadro de
di&aacute;logo Servicio de base de datos.
<P>
<A NAME="IDX241"></A>
Cada c&eacute;lula de AFS debe contener al menos un Servidor de base de datos.
Cada Servidor de base de datos ejecuta los procesos de base de datos que
mantienen las bases de datos de AFS: la Base de datos de
autentificaci&oacute;n, la Base de datos de protecci&oacute;n, la Base de datos de ubicaci&oacute;n
de volumen y, opcionalmente, la Base de datos de copia de seguridad.
<P>Puesto que est&aacute; configurando el primer AFS Server de una c&eacute;lula nueva, el
Servicio de base de datos debe estar configurado en el servidor, y se
configurar&aacute; autom&aacute;ticamente.
</LI><LI>Seleccione el bot&oacute;n <B>Siguiente</B>. Aparecer&aacute; el recuadro de
di&aacute;logo Servidor de copia de seguridad.
<P>
<A NAME="IDX242"></A>
Un Servidor de copia de seguridad mantiene la Base de datos de copia de
seguridad en la que se guarda la informaci&oacute;n relacionada con el Sistema de
copia de seguridad. El Servidor de copia de seguridad permite al
administrador del sistema AFS hacer copia de seguridad de los datos del
espacio de archivos de AFS de los vol&uacute;menes en cinta. Luego los datos
se pueden restaurar desde cinta en el caso de que se pierdan en el sistema de
archivos (por ejemplo, en el caso de que se pierdan datos debido a un error de
disco).
</LI><LI>Seleccione la opci&oacute;n <B>S&iacute;, configurar como Servidor de copia de
seguridad</B> si desea configurar este AFS Server como un Servidor de copia
de seguridad. Si no desea configurar este AFS Server como un Servidor
de copia de seguridad, seleccione la opci&oacute;n <B>No, no configurar como
Servidor de copia de seguridad</B>.
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Nota:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">Si se configura el Servidor de copia de seguridad en cualquier Servidor de
base de datos de la c&eacute;lula, se debe configurar en <I>todos</I> los
Servidores de bases de datos de la c&eacute;lula.
</TD></TR></TABLE>
</LI><LI>Seleccione el bot&oacute;n <B>Siguiente</B>. Aparecer&aacute; el recuadro de
di&aacute;logo Partici&oacute;n de AFS.
<P>
<A NAME="IDX243"></A>
Cada Servidor de archivos de AFS debe tener al menos una partici&oacute;n designada
exclusivamente para guardar vol&uacute;menes de AFS y todos los vol&uacute;menes de AFS
deben residir en particiones que se hayan designado como particiones de
AFS. En una m&aacute;quina Windows NT, s&oacute;lo los vol&uacute;menes NTFS se pueden
designar como particiones de AFS. Adem&aacute;s, las particiones de AFS s&oacute;lo
se pueden crear en vol&uacute;menes NTFS que est&eacute;n vac&iacute;os (o que s&oacute;lo contengan la
Papelera de reciclaje de Windows NT).
<P>Puesto que est&aacute; configurando el primer AFS Server de una c&eacute;lula nueva, debe
designar una partici&oacute;n de AFS en el servidor.
</LI><LI>En la lista de vol&uacute;menes NTFS, seleccione el volumen que desee designar
como una partici&oacute;n de AFS. En el recuadro <B>Nombre de partici&oacute;n de
AFS</B>, especifique la &uacute;ltima parte del nombre de partici&oacute;n. 
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Nota:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">Un AFS Server puede contener un m&aacute;ximo de 256 particiones de AFS. Por
convenio, cada partici&oacute;n se denomina <B>/vicep</B><I>x</I>, donde
<I>x</I> puede ser una o dos letras min&uacute;sculas del alfabeto ingl&eacute;s.
Las particiones de AFS se pueden denominar desde <B>/vicepa</B>,
<B>/vicepb</B>, etc., y seguir hasta <B>/vicepz</B>. Las
particiones adicionales se pueden llamar de <B>/vicepaa</B> a
<B>vicepaz</B> etc., hasta <B>/vicepiv</B>.
</TD></TR></TABLE>
<P>Se recomienda utilizar la letra de la unidad del volumen NTFS como la
&uacute;ltima letra del nombre de partici&oacute;n.
</LI><LI>Seleccione el bot&oacute;n <B>Siguiente</B>. Aparecer&aacute; el recuadro de
di&aacute;logo Vol&uacute;menes de AFS de ra&iacute;z. 
<P>
<A NAME="IDX244"></A>
<A NAME="IDX245"></A>
<A NAME="IDX246"></A>
Los vol&uacute;menes de AFS de ra&iacute;z son dos vol&uacute;menes que cada c&eacute;lula de AFS debe
incluir en su sistema de archivos. Se denominan:
<UL>
<LI><B>root.afs</B>, para el volumen correspondiente al nivel
superior (<B>/afs</B>) del espacio de archivos de AFS
</LI><LI><B>root.cell</B>, para el volumen montado justo debajo de
<B>/afs</B> en el nombre de c&eacute;lula (por ejemplo,
<B>/afs/suempresa.com</B> en la c&eacute;lula
<B>suempresa.com</B>)
</LI></UL>
<P>Puesto que est&aacute; configurando el primer AFS Server de una c&eacute;lula nueva, los
vol&uacute;menes de ra&iacute;z de la c&eacute;lula deben estar creados en el servidor, y se
crear&aacute;n autom&aacute;ticamente durante la configuraci&oacute;n del servidor.
</LI><LI>Seleccione el bot&oacute;n <B>Siguiente</B>. Aparecer&aacute; el recuadro de
di&aacute;logo Duplicaci&oacute;n.
<P>
<A NAME="IDX247"></A>
Si desea poder aprovechar las funciones de duplicaci&oacute;n de AFS, los vol&uacute;menes
de ra&iacute;z de AFS deben estar duplicados. El proceso de duplicaci&oacute;n crea
una o m&aacute;s copias de s&oacute;lo lectura de un volumen de AFS y distribuye dichas
copias a uno o m&aacute;s sitios (servidores y particiones de AFS). La
duplicaci&oacute;n aumenta la eficiencia del sistema y mejora la disponibilidad de
los datos, puesto que se puede acceder al contenido de un volumen de AFS en
una o m&aacute;s m&aacute;quinas Servidor de archivos de AFS.
<P>Puesto que est&aacute; configurando el primer AFS Server de una c&eacute;lula nueva, los
vol&uacute;menes de ra&iacute;z de la c&eacute;lula deben estar duplicados en el servidor, y se
duplicar&aacute;n autom&aacute;ticamente durante la configuraci&oacute;n del servidor.
</LI><LI>Seleccione el bot&oacute;n <B>Siguiente</B>. Aparecer&aacute; el recuadro de
di&aacute;logo Servicio de control del sistema.
<P>
<A NAME="IDX248"></A>
En c&eacute;lulas que ejecutan la versi&oacute;n dom&eacute;stica de AFS para Windows, el Servidor
de control del sistema distribuye nuevas versiones de la informaci&oacute;n de
configuraci&oacute;n de AFS Server a todos los AFS Server. En general se
recomienda designar el primer servidor de una c&eacute;lula de AFS como el Servidor
de control del sistema. (Las c&eacute;lulas que ejecutan la versi&oacute;n
internacional de AFS para Windows no utilizan el Servidor de control del
sistema para distribuir archivos de configuraci&oacute;n del sistema).
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Nota:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">La funci&oacute;n de Servidor de control del sistema se puede asignar posteriormente
a otra m&aacute;quina servidor si se desea. Sin embargo, en funci&oacute;n del n&uacute;mero
de AFS Server de la c&eacute;lula, el proceso de asignar la funci&oacute;n a otra m&aacute;quina
puede llevar mucho tiempo.
</TD></TR></TABLE>
</LI><LI>Para configurar este AFS Server como Servidor de control del sistema
correspondiente a la c&eacute;lula de AFS, seleccione la opci&oacute;n <B>Configurar como
Servidor de control del sistema</B>. Si no desea configurar este AFS
Server como el Servidor de control del sistema correspondiente a la c&eacute;lula de
AFS, seleccione la opci&oacute;n <B>No configurar como Servidor de control del
sistema</B>.
</LI><LI>Seleccione el bot&oacute;n <B>Siguiente</B>. Aparecer&aacute; el recuadro de
di&aacute;logo Configurar el sistema.
<P>Se muestra una lista de los pasos que se seguir&aacute;n para configurar este AFS
Server, lo que le permite ver los pasos antes de empezar el proceso real de
configuraci&oacute;n. 
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Nota:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">Para volver a un paso anterior para revisar o modificar sus selecciones,
pulse el bot&oacute;n <B>Anterior</B>.
</TD></TR></TABLE>
</LI><LI>Para empezar la configuraci&oacute;n de AFS Server en esta m&aacute;quina, seleccione el
bot&oacute;n <B>Configurar</B>. El AFS Server se configura de acuerdo con
sus especificaciones. La barra de proceso que hay en la parte inferior
del recuadro de di&aacute;logo indica los pasos que se est&aacute;n ejecutando.
Aparece un recuadro de mensaje que indica que la configuraci&oacute;n ha
finalizado.
</LI></OL>
<P>
<A NAME="IDX249"></A>
<B>Para configurar el AFS Server en una c&eacute;lula de AFS existente:</B>
<OL TYPE=1>
<LI>En el men&uacute; <B>Inicio</B>, seleccione <B>Programas</B>, luego
<B>IBM AFS</B>, luego <B>Servidor</B> y luego <B>Asistente de
configuraci&oacute;n</B>. Se abrir&aacute; el Asistente de inicio r&aacute;pido de AFS
Server.
</LI><LI>Seleccione el bot&oacute;n <B>Siguiente</B>. Aparecer&aacute; el recuadro de
di&aacute;logo Informaci&oacute;n de c&eacute;lula y servidor.
</LI><LI>Seleccione la opci&oacute;n <B>Hacer que este sistema principal sea un servidor
en una c&eacute;lula de AFS existente</B>.
</LI><LI>En el recuadro <B>Nombre de c&eacute;lula</B>, especifique el nombre de la
c&eacute;lula de AFS a la que desea a&ntilde;adir el nuevo AFS Server.
</LI><LI>Seleccione el bot&oacute;n <B>Siguiente</B>. Aparecer&aacute; el recuadro de
di&aacute;logo Informaci&oacute;n administrativa.
</LI><LI>En el recuadro <B>Nombre</B>, especifique el nombre de usuario de la
cuenta administrativa de AFS, por ejemplo <B>admin</B>, o el nombre de
usuario de una cuenta de usuario de AFS con privilegios de
administraci&oacute;n.
</LI><LI>En el recuadro <B>Contrase&ntilde;a</B>, especifique la contrase&ntilde;a
correspondiente a la cuenta administrativa de AFS o a la cuenta de usuario de
AFS con privilegios de administraci&oacute;n que ha especificado en el recuadro
<B>Nombre</B>.
</LI><LI>En el recuadro <B>AFS Server</B>, especifique el nombre de sistema
principal de un AFS Server en ejecuci&oacute;n en esta c&eacute;lula de AFS. La
informaci&oacute;n de configuraci&oacute;n de AFS se recuperar&aacute; del servidor y se utilizar&aacute;
al configurar este nuevo AFS Server.
</LI><LI>Seleccione el bot&oacute;n <B>Siguiente</B>. Aparecer&aacute; el recuadro de
di&aacute;logo Servicio de archivos.
<P>
<A NAME="IDX250"></A>
Los Servidores de archivos de AFS ofrecen los datos y archivos solicitados del
servidor a los AFS Client. Los Servidores de archivos guardan archivos
y datos, manejan solicitudes para copiar, mover, crear y suprimir archivos y
directorios y efect&uacute;an un seguimiento de la informaci&oacute;n de estado sobre cada
archivo y directorio del servidor.
<P>Para configurar este AFS Server como Servidor de archivos, seleccione la
opci&oacute;n <B>S&iacute;, configurar como Servidor de archivos</B>. Si no desea
configurar este AFS Server como Servidor de archivos, seleccione la opci&oacute;n
<B>No, no configurar como Servidor de archivos</B>.
</LI><LI>Seleccione el bot&oacute;n <B>Siguiente</B>. Aparecer&aacute; el recuadro de
di&aacute;logo Servicio de base de datos.
<P>
<A NAME="IDX251"></A>
Cada c&eacute;lula de AFS debe contener al menos un Servidor de base de datos.
Cada Servidor de base de datos ejecuta los procesos de bases de datos que
mantienen las bases de datos de AFS: la Base de datos de
autentificaci&oacute;n, la Base de datos de protecci&oacute;n, la Base de datos de ubicaci&oacute;n
de volumen y, opcionalmente, la Base de datos de copia de seguridad.
<P>Para configurar este AFS Server como Servidor de base de datos, seleccione
la opci&oacute;n <B>S&iacute;, configurar como Servidor de base de datos</B>. Si
hay un Servidor de control del sistema en la c&eacute;lula de AFS a la que est&aacute;
a&ntilde;adiendo el servidor, entre su nombre de sistema principal en el recuadro
Servidor de control del sistema. Este servidor actualizar&aacute; la
informaci&oacute;n de configuraci&oacute;n de AFS (por ejemplo, la lista de Servidores de
base de datos de AFS que se mantienen en el archivo <B>CellServDB</B> de
cada m&aacute;quina AFS Server). Si no desea configurar este AFS Server como
Servidor de base de datos, seleccione la opci&oacute;n <B>No, no configurar como
Servidor de base de datos</B>.
</LI><LI>Seleccione el bot&oacute;n <B>Siguiente</B>. Aparecer&aacute; el recuadro de
di&aacute;logo Servidor de copia de seguridad.
<P>
<A NAME="IDX252"></A>
Un Servidor de copia de seguridad mantiene la Base de datos de copia de
seguridad en la que se guarda la informaci&oacute;n relacionada con el Sistema de
copia de seguridad. El Servidor de copia de seguridad permite al
administrador del sistema AFS hacer copia de seguridad de los datos del
espacio de archivos de AFS de los vol&uacute;menes en cinta. Luego los datos
se pueden restaurar de cinta en el caso de que se pierdan en el sistema de
archivos (por ejemplo, en el caso de que se pierdan datos debido a un error de
disco). 
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Nota:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">El Servidor de copia de seguridad s&oacute;lo se puede configurar en una m&aacute;quina
configurada como Servidor de base de datos. Adem&aacute;s, si el Servidor de
copia de seguridad se configura en cualquier Servidor de base de datos de la
c&eacute;lula, se debe configurar en <I>todos</I> los Servidores de base de datos
de la c&eacute;lula.
</TD></TR></TABLE>
</LI><LI>Seleccione la opci&oacute;n <B>S&iacute;, configurar como Servidor de copia de
seguridad</B> si desea configurar este AFS Server como un Servidor de copia
de seguridad. Si no desea configurar este AFS Server como un Servidor
de copia de seguridad, seleccione la opci&oacute;n <B>No, no configurar como
Servidor de copia de seguridad</B>.
</LI><LI>Seleccione el bot&oacute;n <B>Siguiente</B>. Aparecer&aacute; el recuadro de
di&aacute;logo Partici&oacute;n de AFS.
<P>Si est&aacute; configurando este AFS Server como Servidor de archivos, debe
especificar un volumen NTFS a designar como partici&oacute;n de AFS. Cada
Servidor de archivos de AFS debe tener al menos una partici&oacute;n designada
exclusivamente para guardar vol&uacute;menes de AFS y todos los vol&uacute;menes de AFS
deben residir en particiones que se hayan designado como particiones de
AFS. En una m&aacute;quina Windows NT, s&oacute;lo los vol&uacute;menes NTFS se pueden
designar como particiones de AFS. Adem&aacute;s, las particiones de AFS s&oacute;lo
se pueden crear en vol&uacute;menes NTFS que est&eacute;n vac&iacute;os (o que s&oacute;lo contengan la
Papelera de reciclaje de Windows NT).
<P>Para designar un volumen como partici&oacute;n de AFS, seleccione la opci&oacute;n
<B>S&iacute;, crear una partici&oacute;n</B>. En la lista de vol&uacute;menes NTFS,
seleccione el volumen que desee designar como partici&oacute;n de AFS. En el
recuadro <B>Nombre de partici&oacute;n de AFS</B>, especifique la &uacute;ltima parte
del nombre de partici&oacute;n.
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Nota:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">Un AFS Server puede contener un m&aacute;ximo de 256 particiones de AFS. Por
convenio, cada partici&oacute;n se denomina <B>/vicep</B><I>x</I>, donde
<I>x</I> puede ser una o dos letras min&uacute;sculas del alfabeto ingl&eacute;s.
Las particiones de AFS se pueden denominar desde <B>/vicepa</B>,
<B>/vicepb</B>, etc., y seguir hasta <B>/vicepz</B>. Las
particiones adicionales se pueden llamar de <B>/vicepaa</B> a
<B>vicepaz</B> etc., hasta <B>/vicepiv</B>.
</TD></TR></TABLE>
<P>Se recomienda utilizar la letra de la unidad del volumen NTFS como la
&uacute;ltima letra del nombre de partici&oacute;n.
<P>Si no desea designar un volumen como partici&oacute;n de AFS, seleccione la opci&oacute;n
<B>No, no crear una partici&oacute;n</B>.
</LI><LI>Seleccione el bot&oacute;n <B>Siguiente</B>. Aparecer&aacute; el recuadro de
di&aacute;logo Vol&uacute;menes de AFS de ra&iacute;z. 
<P>Los vol&uacute;menes de AFS de ra&iacute;z son dos vol&uacute;menes que cada c&eacute;lula de AFS debe
incluir en su sistema de archivos. Se denominan:
<UL>
<LI><B>root.afs</B>, para el volumen correspondiente al nivel
superior (<B>/afs</B>) del espacio de archivos de AFS
</LI><LI><B>root.cell</B>, para el volumen montado justo debajo de
<B>/afs</B> en el nombre de c&eacute;lula (por ejemplo,
<B>/afs/suempresa.com</B> en la c&eacute;lula
<B>suempresa.com</B>)
</LI></UL>
<A NAME="IDX253"></A>
Puesto que est&aacute; a&ntilde;adiendo este AFS Server a una c&eacute;lula de AFS existente, los
vol&uacute;menes de AFS de ra&iacute;z ya existen en la c&eacute;lula y el Asistente de
configuraci&oacute;n de AFS indica que no tiene que crear los vol&uacute;menes de
ra&iacute;z. 
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Nota:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">Si, por cualquier motivo, no existen vol&uacute;menes de AFS de ra&iacute;z en esta c&eacute;lula
de AFS, puede seleccionar la opci&oacute;n <B>S&iacute;, crear los vol&uacute;menes de ra&iacute;z</B>
para crear los vol&uacute;menes de ra&iacute;z en este AFS Server.
</TD></TR></TABLE>
</LI><LI>Seleccione el bot&oacute;n <B>Siguiente</B>. Aparecer&aacute; el recuadro de
di&aacute;logo Duplicaci&oacute;n.
<P>Si desea poder aprovechar las funciones de duplicaci&oacute;n de AFS, los
vol&uacute;menes de ra&iacute;z de AFS deben estar duplicados. El proceso de
duplicaci&oacute;n crea una o m&aacute;s copias de s&oacute;lo lectura de un volumen de AFS y
distribuye dichas copias a uno o m&aacute;s sitios (servidores y particiones de
AFS). La duplicaci&oacute;n aumenta la eficiencia del sistema y mejora la
disponibilidad de los datos, puesto que se puede acceder al contenido de un
volumen de AFS en una o m&aacute;s m&aacute;quinas Servidor de archivos de AFS.
<P>Puesto que est&aacute; a&ntilde;adiendo este AFS Server a una c&eacute;lula de AFS existente, es
probable que los vol&uacute;menes de AFS de ra&iacute;z ya est&eacute;n duplicados, y el Asistente
de configuraci&oacute;n de AFS Server le indicar&aacute; que no tiene que duplicar los
vol&uacute;menes de AFS de ra&iacute;z. 
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Nota:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">Si, por cualquier motivo, los vol&uacute;menes de AFS de ra&iacute;z no est&aacute;n duplicados en
esta c&eacute;lula de AFS, puede seleccionar la opci&oacute;n <B>S&iacute;, duplicar los
vol&uacute;menes de ra&iacute;z</B> para duplicar los vol&uacute;menes de ra&iacute;z de la c&eacute;lula de
AFS en este AFS Server.
</TD></TR></TABLE>
</LI><LI>Seleccione el bot&oacute;n <B>Siguiente</B>. Aparecer&aacute; el recuadro de
di&aacute;logo Servicio de control del sistema.
<P>En c&eacute;lulas que ejecutan la versi&oacute;n dom&eacute;stica de AFS para Windows, el
Servidor de control del sistema distribuye nuevas versiones de la informaci&oacute;n
de configuraci&oacute;n de AFS Server a todos los AFS Server y las m&aacute;quinas Cliente
de control del sistema obtienen archivos comunes de configuraci&oacute;n de AFS de la
m&aacute;quina de Control del sistema. (Las c&eacute;lulas que ejecutan la versi&oacute;n
internacional de AFS para Windows no utilizan el Servidor de control del
sistema para distribuir archivos de configuraci&oacute;n del sistema ni el Cliente de
control del sistema para obtener estos archivos).
</LI><LI>Para configurar este AFS Server como el Servidor de control del sistema
correspondiente a la c&eacute;lula de AFS, seleccione la opci&oacute;n <B>Configurar como
Servidor de control del sistema</B>. Para configurar este AFS Server
como Cliente de control del sistema, seleccione la opci&oacute;n <B>Configurar como
Cliente de control del sistema</B> y especifique el nombre de sistema
principal del Servidor de control del sistema de esta c&eacute;lula de AFS.
AFS Server obtendr&aacute; nuevas versiones de la informaci&oacute;n de configuraci&oacute;n de AFS
Server del servidor especificado. Si no desea configurar este AFS
Server como Servidor de control del sistema de la c&eacute;lula de AFS ni como
Cliente de control del sistema, seleccione la opci&oacute;n <B>No configurar como
Servidor o Cliente de control del sistema</B>.
</LI><LI>Seleccione el bot&oacute;n <B>Siguiente</B>. Aparecer&aacute; el recuadro de
di&aacute;logo Configurar el sistema.
<P>Se muestra una lista de los pasos que se seguir&aacute;n para configurar este AFS
Server, lo que le permite ver los pasos antes de empezar el proceso real de
configuraci&oacute;n. 
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Nota:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">Para volver a un paso anterior para revisar o modificar sus selecciones,
pulse el bot&oacute;n <B>Anterior</B>.
</TD></TR></TABLE>
</LI><LI>Para empezar la configuraci&oacute;n de AFS Server en esta m&aacute;quina, seleccione el
bot&oacute;n <B>Configurar</B>. Si est&aacute; configurando el AFS Server en una
c&eacute;lula de AFS en la que hay Servidores de base de datos que ejecutan una
versi&oacute;n de AFS anterior a la versi&oacute;n 3.5, aparecer&aacute; un recuadro de
di&aacute;logo que le solicita que especifique la contrase&ntilde;a del principal de
AFS. 
<P>El AFS Server se configura de acuerdo con sus especificaciones. La
barra de proceso que hay en la parte inferior del recuadro de di&aacute;logo indica
los pasos que se est&aacute;n ejecutando. Aparece un recuadro de mensaje que
indica que la configuraci&oacute;n ha finalizado.
</LI></OL>
<P><H3><A NAME="Header_28" HREF="awqbg002.htm#ToC_28">Para configurar el AFS Control Center</A></H3>
<A NAME="IDX254"></A>
<A NAME="IDX255"></A>
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Nota:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">Si ha instalado el AFS Control Center junto con el AFS Server y/o junto con
el AFS Client, no tiene que configurar el AFS Control Center. El AFS
Control Center se configura autom&aacute;ticamente cuando se configura el AFS Server
o el AFS Client. Si s&oacute;lo ha instalado el AFS Control Center, debe
configurar el Control Center en su sistema para poderlo utilizar.
</TD></TR></TABLE>
<OL TYPE=1>
<LI>En el men&uacute; <B>Inicio</B>, seleccione <B>Configuraci&oacute;n</B> y luego
<B>Panel de control</B>.
</LI><LI>Efect&uacute;e una doble pulsaci&oacute;n en el icono <B>AFS Control
Center</B>. Aparecer&aacute; el recuadro de di&aacute;logo Propiedades de AFS
Control Center.
</LI><LI>En el recuadro <B>C&eacute;lula por omisi&oacute;n</B>, especifique el nombre
completo de la c&eacute;lula de AFS a administrar por omisi&oacute;n.
</LI><LI>Si la c&eacute;lula que debe administrar el AFS Control Center no aparece en la
lista de c&eacute;lulas de AFS, seleccione el bot&oacute;n <B>A&ntilde;adir</B>.
Aparecer&aacute; el recuadro de di&aacute;logo C&eacute;lula nueva. Especifique el nombre de
la c&eacute;lula en el recuadro <B>C&eacute;lula de AFS</B> y una breve descripci&oacute;n en
el recuadro <B>Descripci&oacute;n</B>.
<P>Seleccione el bot&oacute;n <B>A&ntilde;adir</B>. Aparecer&aacute; el recuadro de
di&aacute;logo A&ntilde;adir servidor. En el recuadro <B>Nombre de servidor</B>,
especifique el nombre de un Servidor de ubicaci&oacute;n de volumen de la c&eacute;lula
seleccionada. Seleccione <B>Aceptar</B> para cerrar el recuadro de
di&aacute;logo A&ntilde;adir servidor. Repita este proceso para a&ntilde;adir informaci&oacute;n
correspondiente a todos los Servidores de ubicaci&oacute;n de volumen de la
c&eacute;lula. Una vez haya especificado informaci&oacute;n correspondiente a todos
los servidores, seleccione <B>Aceptar</B> para cerrar el recuadro de
di&aacute;logo C&eacute;lula nueva.
</LI><LI>Seleccione <B>Aceptar</B> para cerrar el recuadro de di&aacute;logo
Propiedades de AFS Control Center.
</LI></OL>
<P>Ahora el AFS Control Center est&aacute; configurado.
<A NAME="IDX256"></A>
<HR><H2><A NAME="HDRUNINSTALL" HREF="awqbg002.htm#ToC_29">Desinstalaci&oacute;n de AFS para Windows</A></H2>
<P>Esta secci&oacute;n describe los requisitos previos a la desinstalaci&oacute;n, el
procedimiento a seguir para desinstalar AFS para Windows y los cambios que
efect&uacute;a en el sistema el proceso de desinstalaci&oacute;n.
<A NAME="IDX257"></A>
<A NAME="IDX258"></A>
<P><H3><A NAME="Header_30" HREF="awqbg002.htm#ToC_30">Reinstalaci&oacute;n y actualizaci&oacute;n</A></H3>
<P>En una m&aacute;quina Windows NT, <I>no</I> es necesario desinstalar los
componentes de AFS para Windows para volver a instalar o para actualizar el
software. Para volver a instalar o para actualizar AFS para Windows,
siga el procedimiento de instalaci&oacute;n descrito en el apartado <A HREF="#HDRHOWTOINSTALL">Para instalar AFS para Windows</A>. Durante el proceso de instalaci&oacute;n, se sustituyen los
componentes de AFS previamente instalados. La informaci&oacute;n de
configuraci&oacute;n de AFS se conserva.
<P>En una m&aacute;quina Windows 95 o Windows 98, tiene que desinstalar el componente
AFS Light previamente instalado, tal como se describe en el apartado <A HREF="#HDRTOUNINSTALL">Para desinstalar AFS para Windows</A>, antes de volver a instalar o de actualizar AFS
Light.
<A NAME="IDX259"></A>
<A NAME="IDX260"></A>
<A NAME="IDX261"></A>
<P><H3><A NAME="Header_31" HREF="awqbg002.htm#ToC_31">Requisitos previos a la desinstalaci&oacute;n</A></H3>
<P>Al desinstalar AFS se suprimen todos los archivos de la aplicaci&oacute;n
AFS. Estos archivos no se pueden suprimir si otras aplicaciones los
est&aacute;n utilizando. Por este motivo, debe cerrar todos los recuadros de
di&aacute;logo de AFS antes de desinstalar AFS para Windows.
<P>Si est&aacute; desinstalando el AFS Server para dejar de utilizar la m&aacute;quina, debe
cumplir con los siguientes requisitos previos para que no se pierdan
datos:
<OL TYPE=1>
<LI>Si el AFS Server est&aacute; funcionando como Servidor de archivos, mueva todos
los vol&uacute;menes de lectura/grabaci&oacute;n a otro Servidor de archivos de AFS y
elimine todos los vol&uacute;menes de s&oacute;lo lectura.
</LI><LI>Desconfigure el AFS Server. Abra el programa de utilidad
Configuraci&oacute;n de AFS Server y seleccione la pesta&ntilde;a
<B>Servidor</B>. Borre las marcas de todos los recuadros de
selecci&oacute;n y pulse <B>Aceptar</B>.
</LI></OL>
<A NAME="IDX262"></A>
<A NAME="IDX263"></A>
<A NAME="IDX264"></A>
<A NAME="IDX265"></A>
<A NAME="IDX266"></A>
<A NAME="IDX267"></A>
<A NAME="IDX268"></A>
<P><H3><A NAME="HDRTOUNINSTALL" HREF="awqbg002.htm#ToC_32">Para desinstalar AFS para Windows</A></H3>
<OL TYPE=1>
<LI>En el men&uacute; <B>Inicio</B>, seleccione <B>Configuraci&oacute;n</B> y luego
<B>Panel de control</B>.
</LI><LI>Efect&uacute;e una doble pulsaci&oacute;n sobre el icono <B>Agregar o quitar
programas</B>. Se abrir&aacute; el recuadro de di&aacute;logo Propiedades de
agregar o quitar programas, por la pesta&ntilde;a <B>Instalar o
desinstalar</B>.
</LI><LI>Cierre el Panel de control.
</LI><LI>Seleccione el componente de AFS que desea desinstalar y seleccione el
bot&oacute;n <B>Agregar o quitar</B>. Aparecer&aacute; el recuadro de di&aacute;logo
Confirmar la eliminaci&oacute;n de archivos, para que verifique que desea eliminar
los componentes seleccionados de AFS para Windows. Pulse <B>S&iacute;</B>
para continuar con el proceso de desinstalaci&oacute;n.
</LI><LI>Aparecer&aacute; un recuadro de mensaje de AFS que le pregunta si desea conservar
la informaci&oacute;n de configuraci&oacute;n. Seleccione <B>S&iacute;</B> para
conservar la informaci&oacute;n de configuraci&oacute;n o <B>No</B> para suprimir toda
la informaci&oacute;n de configuraci&oacute;n. (No hay informaci&oacute;n de configuraci&oacute;n
asociada al componente AFS Supplemental Documentation. Si est&aacute;
eliminando este componente del sistema, no aparece este recuadro de mensaje de
AFS).
</LI><LI>Se abre el recuadro de di&aacute;logo Quitar programas de su equipo, que muestra
los componentes que se est&aacute;n eliminando del sistema. 
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Nota:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">Es posible que aparezca un recuadro de mensaje que le pregunta si desea
eliminar los archivos de AFS compartidos que ya no necesita ning&uacute;n otro
componente. Pulse <B>S&iacute; a todo</B> para eliminar por completo el
componente seleccionado de AFS.
</TD></TR></TABLE>
</LI></OL>
<P>El componente seleccionado de AFS para Windows se ha desinstalado.
Si ha instalado una combinaci&oacute;n de componentes de AFS para Windows, debe
repetir los pasos del 4 al 6 para eliminar cada componente por
separado.
<P><H3><A NAME="Header_33" HREF="awqbg002.htm#ToC_33">Cambios efectuados en el sistema</A></H3>
<A NAME="IDX269"></A>
<P><H4><A NAME="Header_34">Cambios efectuados en el sistema al desinstalar el AFS Client</A></H4>
<P>El proceso de desinstalaci&oacute;n del AFS Client efect&uacute;a los siguientes
cambios en el sistema:
<UL>
<LI>Elimina todos los archivos de AFS Client del directorio <B>\Archivos de
programa\Ibm\Afs\Client\Program</B>, elimina el directorio <B>Client</B>
y, si no queda ning&uacute;n otro componente de AFS instalado, elimina el directorio
<B>Ibm</B>. 
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Nota:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">Los directorios <I>no</I> se eliminan si contienen archivos que no sean
los que instala el programa <B>setup</B> de AFS para Windows.
</TD></TR></TABLE>
</LI><LI>Elimina el grupo de programas <B>IBM AFS</B> del men&uacute;
<B>Inicio</B> si no queda ning&uacute;n otro componente de AFS instalado.
</LI><LI>Elimina el icono <B>Configuraci&oacute;n de AFS Client</B> del Panel de
control.
</LI><LI>Elimina el Men&uacute; de AFS del men&uacute; de contexto del Explorador de Windows
NT.
</LI><LI>Suprime el servicio <B>IBM AFS Client</B>.
</LI><LI>Elimina del sistema las entradas de registro relacionadas con el AFS
Client. Tenga en cuenta que si ha elegido conservar la informaci&oacute;n de
configuraci&oacute;n, parte de la misma se conserva en el registro tras el proceso de
desinstalaci&oacute;n.
</LI></UL>
<P><H4><A NAME="Header_35">Cambios efectuados en el sistema al desinstalar AFS Light</A></H4>
<P>El proceso de desinstalaci&oacute;n de AFS Light efect&uacute;a los siguientes
cambios en el sistema:
<UL>
<LI>Elimina todos los archivos de AFS del directorio <B>\Archivos de
programa\Ibm\Afs\Client\Program</B> y elimina el directorio
<B>Ibm</B>. 
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Nota:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">Los directorios <I>no</I> se eliminan si contienen archivos que no sean
los que instala el programa <B>setup</B> de AFS para Windows.
</TD></TR></TABLE>
</LI><LI>Elimina el grupo de programas <B>IBM AFS</B> del men&uacute;
<B>Inicio</B>.
</LI><LI>Elimina el icono <B>Configuraci&oacute;n de AFS Light</B> del Panel de
control.
</LI><LI>Elimina el Men&uacute; de AFS del men&uacute; de contexto del Explorador de
Windows.
</LI><LI>Elimina del sistema las entradas de registro relacionadas con AFS
Light. Tenga en cuenta que si ha elegido conservar la informaci&oacute;n de
configuraci&oacute;n, parte de la misma se conserva en el registro tras el proceso de
desinstalaci&oacute;n.
</LI></UL>
<P><H4><A NAME="Header_36">Cambios efectuados en el sistema al desinstalar el AFS Server</A></H4>
<P>El proceso de desinstalaci&oacute;n del AFS Client efect&uacute;a los siguientes
cambios en el sistema:
<UL>
<LI>Elimina todos los archivos de AFS Server del directorio <B>\Archivos de
programa\Ibm\Afs\Server</B>, elimina el directorio <B>Server</B> y, si
no queda ning&uacute;n otro componente de AFS instalado, elimina el directorio
<B>Ibm</B>. 
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Nota:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">Estos directorios <I>no</I> se eliminan si contienen archivos que no sean
los que instala el programa <B>setup</B> de AFS para Windows. Si ha
elegido conservar la informaci&oacute;n de configuraci&oacute;n, algunos archivos del
directorio <B>\Archivos de programa\Ibm\Afs\Server</B> <I>no</I> se
eliminan.
</TD></TR></TABLE>
</LI><LI>Elimina el grupo de programas <B>IBM AFS</B> del men&uacute;
<B>Inicio</B> si no queda ning&uacute;n otro componente de AFS instalado.
</LI><LI>Elimina el icono <B>Configuraci&oacute;n de AFS Server</B> del Panel de
control.
</LI><LI>Suprime el servicio <B>IBM AFS Server</B>.
</LI><LI>Elimina del sistema las entradas de registro relacionadas con AFS
Server. Tenga en cuenta que si ha elegido conservar la informaci&oacute;n de
configuraci&oacute;n, parte de la misma se conserva en el registro tras el proceso de
desinstalaci&oacute;n.
</LI></UL>
<P><H4><A NAME="Header_37">Cambios efectuados en el sistema al desinstalar el AFS Control Center</A></H4>
<P>El proceso de desinstalaci&oacute;n del AFS Control Center efect&uacute;a los
siguientes cambios en el sistema:
<UL>
<LI>Elimina todos los archivos de AFS Control Center del directorio
<B>\Archivos de programa\Ibm\Afs\Control Center</B>, elimina el directorio
<B>Control Center</B> y, si no queda ning&uacute;n otro componente de AFS
instalado, elimina el directorio <B>Ibm</B>.
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Nota:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">Estos directorios <I>no</I> se eliminan si contienen archivos que no sean
los que instala el programa <B>setup</B> de AFS para Windows.
</TD></TR></TABLE>
</LI><LI>Elimina el grupo de programas <B>IBM AFS</B> del men&uacute;
<B>Inicio</B> si no queda ning&uacute;n otro componente de AFS instalado.
</LI><LI>Elimina el icono <B>AFS Control Center</B> del Panel de
control. Tenga en cuenta que este icono s&oacute;lo aparece en el Panel de
control si no hay ning&uacute;n otro componente de AFS para Windows instalado en el
sistema.
</LI><LI>Elimina del sistema las entradas de registro relacionadas con el AFS
Control Center. Tenga en cuenta que si ha elegido conservar la
informaci&oacute;n de configuraci&oacute;n, parte de la misma se conserva en el registro
tras el proceso de desinstalaci&oacute;n.
</LI></UL>
<P><H4><A NAME="Header_38">Cambios efectuados en el sistema al desinstalar la AFS Supplemental Documentation</A></H4>
<P>El proceso de desinstalaci&oacute;n de la AFS Supplemental Documentation
efect&uacute;a los siguientes cambios en el sistema:
<UL>
<LI>Elimina los directorios <B>SysAdminGd</B> y <B>CmdRef</B> del
directorio <B>\Archivos de programa\Ibm\Afs\Documentation\Html</B> y, si
no queda ning&uacute;n otro componente de AFS instalado, elimina el directorio
<B>Ibm</B>.
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Nota:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">Estos directorios <I>no</I> se eliminan si contienen archivos que no sean
los que instala el programa <B>setup</B> de AFS para Windows.
</TD></TR></TABLE>
</LI><LI>Elimina el grupo de programas <B>IBM AFS</B> del men&uacute;
<B>Inicio</B> si no queda ning&uacute;n otro componente de AFS instalado.
</LI><LI>Elimina del sistema las entradas de registro relacionadas con AFS
Supplemental Documentation.
</LI></UL>
<P><HR><B>&#91; <A HREF="#Top_Of_Page">Principio de p&aacute;gina</A> &#124; <A HREF="awqbg002.htm">P&aacute;gina anterior</A> &#124; <A HREF="awqbg004.htm">P&aacute;gina siguiente</A> &#124; <A HREF="awqbg002.htm#ToC">Contenido</A> &#124; <A HREF="awqbg004.htm#HDRINDEX">&Iacute;ndice</A> &#93;</B> 
<!-- Begin Footer Records  ========================================== -->
<P><HR><B> 
<br>&#169; <A HREF="http://www.ibm.com/">IBM Corporation 2000.</A>  All Rights Reserved 
</B> 
<!-- End Footer Records  ============================================ -->
<A NAME="Bot_Of_Page"></A>
</BODY></HTML>
