<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML 3.2//EN">
<HTML><HEAD>
<TITLE>Erste Schritte</TITLE>
<!-- Begin Header Records  ========================================== -->
<!-- D:\IDWB\TEMP\idwt1361\awqbg000.scr converted by idb2h R4.2 (359) -->
<!-- ID Workbench Version (OS2) on 20 Jan 2000 at 18:35:49            -->
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
<META HTTP-EQUIV="updated" CONTENT="Don, 20 Jan 2000 18:35:48">
<META HTTP-EQUIV="review" CONTENT="Sam, 20 Jan 2001 18:35:48">
<META HTTP-EQUIV="expires" CONTENT="Son, 20 Jan 2002 18:35:48">
</HEAD><BODY>
<!-- (C) IBM Corporation 2000. All Rights Reserved    --> 
<BODY bgcolor="ffffff"> 
<!-- End Header Records  ============================================ -->
<A NAME="Top_Of_Page"></A>
<H1>Erste Schritte</H1>
<HR><H1><A NAME="Header_1" HREF="awqbg002.htm#ToC_1">IBM AFS f&uuml;r Windows Erste Schritte</A></H1>
<HR><H2><A NAME="Header_2" HREF="awqbg002.htm#ToC_2">Einf&uuml;hrung</A></H2>
<A NAME="IDX178"></A>
<A NAME="IDX179"></A>
<P>AFS ist ein Unternehmensdateisystem, das durch einen
gemeinsam benutzten Dateibereich konsistenten Zugriff auf Dateien
bietet. Indem es die lokalen Dateisysteme mehrerer Datei-Server
zusammenf&uuml;hrt, stellt AFS einen einzigen, von Maschinengrenzen unabh&auml;ngigen
Dateibereich bereit. Die Dateien werden auf unterschiedlichen Maschinen
im Netzwerk gespeichert, sind aber von allen Maschinen im Unternehmen aus
zug&auml;nglich.
<P>IBM AFS f&uuml;r Windows, Version 3.6, erweitert
Microsoft Windows-Betriebssysteme um die leistungsstarken
Funktionen von AFS.
<HR><H2><A NAME="Header_3" HREF="awqbg002.htm#ToC_3">&Uuml;bersicht &uuml;ber dieses Dokument</A></H2>
<P>
<A NAME="IDX180"></A>
In diesem Dokument werden die Installationsvoraussetzungen beschrieben,
detaillierte Anweisungen zum Installieren, Konfigurieren und Deinstallieren
von AFS f&uuml;r Windows gegeben und die &Auml;nderungen erkl&auml;rt, die w&auml;hrend der
Installation und Deinstallation am System vorgenommen werden. Dar&uuml;ber
hinaus wird beschrieben, welche Dokumentation zu AFS f&uuml;r Windows verf&uuml;gbar
ist.
<P><H3><A NAME="Header_4" HREF="awqbg002.htm#ToC_4">Zielgruppe</A></H3>
<P>
<A NAME="IDX181"></A>
Dieses Dokument richtet sich an Systemadministratoren und Benutzer, die f&uuml;r
die Installation und Konfiguration der in AFS f&uuml;r Windows enthaltenen Produkte
verantwortlich sind. In diesem Dokument wird davon ausgegangen, da&szlig; der
Systemadministrator mit der Systemverwaltung im allgemeinen vertraut ist und
der Benutzer die grundlegenden Begriffe und Funktionen der Microsoft
Windows-Betriebssysteme kennt.
<P><H3><A NAME="Header_5" HREF="awqbg002.htm#ToC_5"></A></H3>
<P>Dieses Dokument hat folgenden Aufbau:
<UL>
<P><LI>Im Abschnitt <A HREF="#HDRINSTALLATION">Installieren von AFS f&uuml;r Windows</A> werden die Installationsm&ouml;glichkeiten f&uuml;r die
AFS-Komponenten beschrieben, das Verfahren f&uuml;r die Installation der in AFS f&uuml;r
Windows enthaltenen Produkte erkl&auml;rt und die &Auml;nderungen erl&auml;utert, die das
System durch den Installationsvorgang erf&auml;hrt.
</LI><P><LI>Im Abschnitt <A HREF="#HDRDOCUMENT">Die Dokumentation zu AFS f&uuml;r Windows</A> erfahren Sie, welche verschiedenen Dokumentationsarten f&uuml;r
AFS f&uuml;r Windows verf&uuml;gbar sind und wie Sie auf diese Dokumentationen zugreifen
k&ouml;nnen.
</LI><P><LI>Im Abschnitt <A HREF="#HDRCONFIGURE">Konfigurieren von AFS f&uuml;r Windows</A> werden die Verfahren f&uuml;r die Konfiguration der Produkte in
AFS f&uuml;r Windows erkl&auml;rt.
</LI><P><LI>Im Abschnitt <A HREF="#HDRUNINSTALL">Deinstallieren von AFS f&uuml;r Windows</A> werden die Voraussetzungen f&uuml;r die Deinstallation, das
Verfahren zur Deinstallation der Produkte von AFS f&uuml;r Windows und die
&Auml;nderungen beschrieben, die bei der Deinstallation vom System vorgenommen
werden.
</LI></UL>
<HR><H2><A NAME="HDRINSTALLATION" HREF="awqbg002.htm#ToC_6">Installieren von AFS f&uuml;r Windows</A></H2>
<P>In diesem Abschnitt werden die Installationsm&ouml;glichkeiten f&uuml;r die
AFS-Komponenten, das Verfahren f&uuml;r die Installation von AFS f&uuml;r Windows sowie
die &Auml;nderungen beschrieben, die beim Installationsvorgang am System
durchgef&uuml;hrt werden.
<P><H3><A NAME="Header_7" HREF="awqbg002.htm#ToC_7">Die Komponenten von AFS f&uuml;r Windows</A></H3>
<P>
<A NAME="IDX182"></A>
AFS f&uuml;r Windows, Version 3.6, umfa&szlig;t die folgenden Komponenten:
<UL>
<P><LI>
<A NAME="IDX183"></A>
<A NAME="IDX184"></A>
<A NAME="IDX185"></A>
<B>AFS Server</B>
<P>Der AFS Server f&uuml;hrt AFS-Server-Prozesse aus und enth&auml;lt den Assistenten
AFS Server Configuration, der die Installation vereinfacht.
</LI><P><LI>
<A NAME="IDX186"></A>
<A NAME="IDX187"></A>
<A NAME="IDX188"></A>
<B>AFS Control Center</B>
<P>Das AFS Control Center enth&auml;lt zwei leistungsstarke, auf einer GUI
(Graphical User Interface, grafische Benutzerschnittstelle) basierende Tools,
die den AFS-Systemadministrator bei der Verwaltung der AFS-Zellen
unterst&uuml;tzen: den AFS Server Manager und den AFS Account Manager.
</LI><P><LI>
<A NAME="IDX189"></A>
<A NAME="IDX190"></A>
<A NAME="IDX191"></A>
<B>AFS Client</B>
<P>Der AFS Client bietet direkten Zugriff auf den AFS-Dateibereich und
erm&ouml;glicht Benutzern dadurch die Verwaltung von Dateien und Verzeichnissen in
AFS. Er enth&auml;lt au&szlig;erdem das AFS Light Gateway.
</LI><P><LI>
<A NAME="IDX192"></A>
<A NAME="IDX193"></A>
<A NAME="IDX194"></A>
<B>AFS Light</B>
<P>AFS Light bietet &uuml;ber eine AFS Light Gateway-Maschine Zugriff auf den
AFS-Dateibereich und erm&ouml;glicht Benutzern so die Verwaltung von Dateien und
Verzeichnissen in AFS.
</LI><P><LI>
<A NAME="IDX195"></A>
 <B>AFS Supplemental Documentation</B>
<P>AFS Supplemental Documentation bietet zus&auml;tzliche Informationen zur
AFS-Systemadministration und umfa&szlig;t folgende Dokumente: <I>IBM AFS
Administration Guide</I> und <I>IBM AFS Administration
Reference</I>.
</LI></UL>
<P><H3><A NAME="HDROPTIONS" HREF="awqbg002.htm#ToC_8">Installationsoptionen</A></H3>
<P>
<A NAME="IDX196"></A>
<A NAME="IDX197"></A>
<A NAME="IDX198"></A>
Sie k&ouml;nnen die Komponenten von AFS f&uuml;r Windows bei der Installation in
unterschiedlicher Weise kombinieren, je nachdem, welches
Windows-Betriebssystem Sie verwenden. Einzelheiten zu den speziellen
Softwarevoraussetzungen f&uuml;r jede Komponente von AFS f&uuml;r Windows finden Sie in
den <I>IBM AFS for Windows Release Notes</I>. Beachten Sie, da&szlig; Sie
bei Installation von AFS Server auch AFS Client installieren m&uuml;ssen, es sei
denn, AFS Client, Version 3.6, ist bereits auf der Maschine
installiert. Gehen Sie nach dem Installationsverfahren im Abschnitt <A HREF="#HDRHOWTOINSTALL">Vorgehensweise zum Installieren von AFS f&uuml;r Windows</A> vor, ungeachtet dessen, welche Komponenten Sie
installieren.
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Anmerkung:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">
<A NAME="IDX199"></A>
<A NAME="IDX200"></A>
<A NAME="IDX201"></A>
<A NAME="IDX202"></A>
<A NAME="IDX203"></A>
Sie haben die M&ouml;glichkeit, das Konfigurationsprogramm von AFS f&uuml;r Windows so
zu &auml;ndern, da&szlig; nur die Client-Komponente installiert wird. Wird das
Konfigurationsprogramm auf diese Weise modifiziert, kann der Benutzer au&szlig;er
dem AFS Client keine anderen Komponenten installieren. Wenn Sie nur den
Client installieren m&ouml;chten, erstellen Sie die Datei
<B>setup.co</B> im gleichen Verzeichnis wie die anderen
Installationsdateien. Das Konfigurationsprogramm erlaubt dann nur die
Installation von AFS Client. Beachten Sie, da&szlig; der Inhalt der Datei
<B>setup.co</B> irrelevant ist. Gehen Sie nach dem
Installationsverfahren im Abschnitt <A HREF="#HDRHOWTOINSTALL">Vorgehensweise zum Installieren von AFS f&uuml;r Windows</A> vor, ungeachtet dessen, welche Installation Sie
durchf&uuml;hren.
</TD></TR></TABLE>
<P><H3><A NAME="Header_9" HREF="awqbg002.htm#ToC_9">Erweitern einer fr&uuml;heren Version</A></H3>
<P>
<A NAME="IDX204"></A>
<A NAME="IDX205"></A>
<A NAME="IDX206"></A>
Auf einer Windows NT-Maschine ist es <I>nicht</I> erforderlich, zum Zwecke
der Softwareerweiterung die Komponenten von AFS f&uuml;r Windows zu
deinstallieren. Sie k&ouml;nnen das neue Release von AFS f&uuml;r Windows auf dem
System installieren, <I>ohne</I> die bisherige Software entfernen oder
dekonfigurieren zu m&uuml;ssen. Gehen Sie nach dem Installationsverfahren im
Abschnitt <A HREF="#HDRHOWTOINSTALL">Vorgehensweise zum Installieren von AFS f&uuml;r Windows</A> vor, um AFS f&uuml;r Windows zu erweitern. W&auml;hrend des
Installationsvorgangs wird die &auml;ltere Version der AFS-Komponente erweitert,
die AFS-Konfigurationsdaten bleiben erhalten.
<P>Auf einem Windows 95- oder Windows 98-Computer m&uuml;ssen Sie die bisher
installierte Komponente AFS Light deinstallieren, wie im Abschnitt <A HREF="#HDRTOUNINSTALL">Vorgehensweise zum Deinstallieren von AFS f&uuml;r Windows</A> beschrieben, bevor Sie AFS Light erweitern.
<P>Beachten Sie, da&szlig; das Installations-Tool von AFS f&uuml;r Windows
<I>nicht</I> die Installation von AFS-Komponenten mit unterschiedlichen
Versionsnummern erlaubt. Wenn auf einer Maschine mehrere Komponenten
von AFS f&uuml;r Windows installiert sind, k&ouml;nnen Sie eine einzelne Komponente nur
erweitern, wenn Sie gleichzeitig auch alle anderen Komponenten
erweitern.
<P><H3><A NAME="HDRHOWTOINSTALL" HREF="awqbg002.htm#ToC_10">Vorgehensweise zum Installieren von AFS f&uuml;r Windows</A></H3>
<A NAME="IDX207"></A>
<A NAME="IDX208"></A>
<A NAME="IDX209"></A>
<A NAME="IDX210"></A>
<A NAME="IDX211"></A>
<A NAME="IDX212"></A>
<A NAME="IDX213"></A>
<P>Lesen Sie vor dem Installieren von AFS f&uuml;r Windows die ausf&uuml;hrliche
Beschreibung der Installationsvoraussetzungen in den <I>IBM AFS for Windows
Release Notes</I>. Falls gegenw&auml;rtig andere Windows-Anwendungen aktiv
sind, empfiehlt es sich, diese zu beenden, bevor Sie AFS f&uuml;r Windows
installieren. 
<OL TYPE=1>
<P><LI>Legen Sie die Installations-CD-ROM f&uuml;r AFS f&uuml;r Windows in das
CD-ROM-Laufwerk ein.
</LI><P><LI>F&uuml;hren Sie das Programm <B>setup</B> von AFS f&uuml;r Windows aus, indem
Sie eine der folgenden Methoden verwenden: 
<UL>
<P><LI>W&auml;hlen Sie im Men&uuml; <B>Start</B> den Befehl
<B>Ausf&uuml;hren</B>. Geben Sie
<TT><I>Laufwerk</I><B>:\setup</B></TT> ein, wobei
<I>Laufwerk</I> der Laufwerkbuchstabe des CD-ROM-Laufwerks ist.
Klicken Sie auf <B>OK</B>.
</LI><P><LI>W&auml;hlen Sie im <B>Windows-Explorer</B> das CD-ROM-Laufwerk aus, und
doppelklicken Sie auf das Programm <B>setup.exe</B>.
</LI></UL>
</LI><P><LI>Das Dialogfenster Willkommen wird angezeigt. Klicken Sie auf die
Schaltfl&auml;che <B>Weiter</B>, um die Installation fortzusetzen.
</LI><P><LI>Das Dialogfenster Komponenten ausw&auml;hlen wird angezeigt. 
<UL>
<P><LI>W&auml;hlen Sie im Feld <B>Komponenten</B> die Komponenten von AFS f&uuml;r
Windows aus, die installiert oder erweitert werden sollen.
Informationen zu den Komponentenkombinationen, die Sie auf einer
Windows-Maschine installieren k&ouml;nnen, finden Sie im Abschnitt <A HREF="#HDROPTIONS">Installationsoptionen</A>. Beachten Sie, da&szlig; Sie bei Installation von AFS
Server auch AFS Client installieren (bzw. erweitern) m&uuml;ssen, es sei
denn, AFS Client, Version 3.6, ist bereits auf dem System
installiert.
</LI><P><LI>Im Feld <B>Zielordner</B> wird das Standardlaufwerk und -verzeichnis
angegeben, in dem die ausgew&auml;hlten Komponenten installiert werden. Das
Standardlaufwerk ist das Laufwerk, in dem Windows installiert ist. Das
Standardverzeichnis auf diesem Laufwerk ist
<B>\Programme\Ibm\Afs</B>. Wenn Sie ein anderes Laufwerk und/oder
Verzeichnis ausw&auml;hlen m&ouml;chten, klicken Sie auf die Schaltfl&auml;che
<B>Durchsuchen</B>. 
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Anmerkung:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">Wenn Sie eine fr&uuml;here Version von AFS f&uuml;r Windows erweitern oder AFS f&uuml;r
Windows erneut installieren, mu&szlig; das ausgew&auml;hlte Installationsverzeichnis das
gleiche sein wie das Installationsverzeichnis, das Sie f&uuml;r die bisher
installierte Version verwendet haben.
</TD></TR></TABLE>
</LI></UL>
<P>Klicken Sie auf die Schaltfl&auml;che <B>Weiter</B>, um die Installation
fortzusetzen.
</LI><P><LI>Die Anwendungsdateien f&uuml;r die ausgew&auml;hlten Komponenten von AFS f&uuml;r Windows
werden auf dem System installiert. Nach Abschlu&szlig; der Installation wird
das Dialogfenster Installation beendet angezeigt, in dem Sie darauf
hingewiesen werden, da&szlig; Sie das System neustarten m&uuml;ssen, damit Sie die
installierten AFS-Produkte nutzen k&ouml;nnen. Klicken Sie auf <B>Computer
neu starten</B> und dann auf die Schaltfl&auml;che
<B>Fertigstellen</B>. Das System wird heruntergefahren und dann
erneut gestartet. 
<P>Die Installation von AFS f&uuml;r Windows ist abgeschlossen.
</LI></OL>
<P><H3><A NAME="Header_11" HREF="awqbg002.htm#ToC_11">&Auml;nderungen am System</A></H3>
<P>
<A NAME="IDX214"></A>
In diesem Abschnitt werden die &Auml;nderungen erkl&auml;rt, die durch die Installation
der einzelnen Komponenten von AFS f&uuml;r Windows am System vorgenommen
werden. Die Informationen in diesem Abschnitt beruhen auf den
Standard-Installationseinstellungen.
<P><H4><A NAME="HDRCLIENTCHANGE">&Auml;nderungen am System durch Installation des AFS Clients</A></H4>
<P>Wenn Sie AFS Client f&uuml;r Windows NT installieren, werden folgende
&Auml;nderungen am System durchgef&uuml;hrt: 
<UL>
<P><LI>Im Men&uuml; <B>Start</B> wird die Programmgruppe <B>IBM AFS</B> mit
den folgenden Anwendungen erstellt: 
<DL>
<DD><P>Der Programmeintrag <B>Dokumentation</B> bietet Zugriff auf die
AFS-Online-Dokumentation, die im Lieferumfang von AFS f&uuml;r Windows enthalten
ist.
<DD><P>&Uuml;ber die Programmuntergruppe <B>Client</B> haben Sie Zugriff auf das
Merkmalfenster und die Online-Hilfe von AFS Client.
</DL>
</LI><P><LI>Das Men&uuml; AFS wird dem Kontextmen&uuml; des Windows NT-Explorers
hinzugef&uuml;gt.
</LI><P><LI>Ein Dokumentationsverzeichnis wird erstellt, und die Online-Dokumente
<I>IBM AFS f&uuml;r Windows Erste Schritte</I> und <I>IBM AFS for Windows
Release Notes</I> werden in dem Verzeichnis plaziert. Dieses befindet
sich unter <B>\Programme\Ibm\Afs\Documentation</B>.
</LI><P><LI>Der Eintrag <B>AFS-Berechtigungen</B> wird der Programmgruppe
<B>Autostart</B> hinzugef&uuml;gt. Das Symbol <B>AFS Client</B> wird
beim Starten auf der Task-Leiste angezeigt.
</LI><P><LI>Die Installationsverzeichnisse, in denen das Konfigurationsprogramm die
AFS-Bin&auml;rdateien, -Symbole und -Hilfedateien installiert, werden
erstellt. Die Standardverzeichnisse sind
<B>\Programme\Ibm\Afs\Client\Program</B> und
<B>\Programme\Ibm\Afs\Common</B>.
</LI><P><LI>Der AFS Client wird als Service registriert.
</LI><P><LI>Das Dienstprogramm AFS Client Configuration wird installiert, und das
Symbol <B>AFS Client Configuration</B> wird der Systemsteuerung
hinzugef&uuml;gt, indem die Datei <B>afs_cpa.cpl</B> im Verzeichnis
<B>\</B><I>Windows-Standard</I><B>\system32</B> plaziert wird
(<I>Windows-Standard</I> ist hierbei das Windows-Verzeichnis).
</LI><P><LI>Die Datei <B>afsdcell.ini</B> wird im Windows-Verzeichnis und
im Verzeichnis <B>\Programme\Ibm\Afs\Common</B> plaziert. Wenn Sie
eine fr&uuml;here Version des AFS Clients erweitert haben, wird die AFS
Client-Zellendatenbank (<B>afsdcell.ini</B>) im Windows-Verzeichnis
nicht ersetzt.
</LI><P><LI>Die Windows NT-Registrierungsdatenbank wird modifiziert, indem Eintr&auml;ge
f&uuml;r den AFS Client hinzugef&uuml;gt werden.
</LI></UL>
<P><H4><A NAME="Header_13">&Auml;nderungen am System durch Installation von AFS Light</A></H4>
<P>Wenn Sie AFS Light f&uuml;r Windows 95 bzw. Windows 98 installieren,
werden folgende &Auml;nderungen am System durchgef&uuml;hrt: 
<UL>
<P><LI>Eine Programmgruppe <B>IBM AFS</B> mit den folgenden Anwendungen wird
erstellt:
<DL>
<DD><P>Der Programmeintrag <B>Dokumentation</B> bietet Zugriff auf die
AFS-Online-Dokumentation, die im Lieferumfang von AFS f&uuml;r Windows enthalten
ist.
<DD><P>&Uuml;ber die Programmuntergruppe <B>Light</B> haben Sie Zugriff auf das
Merkmalfenster und die Online-Hilfe von AFS Light.
</DL>
</LI><P><LI>Das Men&uuml; AFS wird dem Kontextmen&uuml; des Windows-Explorers
hinzugef&uuml;gt.
</LI><P><LI>Ein Dokumentationsverzeichnis wird erstellt, und die Online-Dokumente
<I>IBM AFS f&uuml;r Windows Erste Schritte</I> und <I>IBM AFS for Windows
Release Notes</I> werden in dem Verzeichnis plaziert. Dieses befindet
sich unter <B>\Programme\Ibm\Afs\Documentation</B>.
</LI><P><LI>Die Installationsverzeichnisse, in denen das Konfigurationsprogramm die
AFS-Bin&auml;rdateien, -Symbole und -Hilfedateien installiert, werden
erstellt. Die Standardverzeichnisse sind
<B>\Programme\Ibm\Afs\Client\Program</B> und
<B>\Programme\Ibm\Afs\Common</B>.
</LI><P><LI>Das Dienstprogramm AFS Light Configuration wird installiert, und das
Symbol <B>AFS Light Configuration</B> wird der Systemsteuerung
hinzugef&uuml;gt, indem die Datei <B>afs_cpa.cpl</B> im Verzeichnis
<B>\</B><I>Windows-Standard</I><B>\system</B> plaziert wird
(<I>Windows-Standard</I> ist hierbei das Windows-Verzeichnis).
</LI><P><LI>Die Datei <B>afsdcell.ini</B> wird im Windows-Verzeichnis und
im Verzeichnis <B>\Programme\Ibm\Afs\Common</B> plaziert.
</LI><P><LI>Die Windows-Registrierungsdatenbank wird modifiziert, indem Eintr&auml;ge f&uuml;r
AFS Light hinzugef&uuml;gt werden.
</LI></UL>
<P><H4><A NAME="Header_14">&Auml;nderungen am System durch Installation von AFS Server</A></H4>
<P>Wenn Sie AFS Server f&uuml;r Windows NT installieren, werden folgende
&Auml;nderungen am System durchgef&uuml;hrt:
<UL>
<P><LI>Im Men&uuml; <B>Start</B> wird die Programmgruppe <B>IBM AFS</B> mit
den folgenden Anwendungen erstellt: 
<DL>
<DD><P>Der Programmeintrag <B>Dokumentation</B> bietet Zugriff auf die
AFS-Online-Dokumentation, die im Lieferumfang von AFS f&uuml;r Windows enthalten
ist.
<DD><P>&Uuml;ber die Programmuntergruppe <B>Server</B> haben Sie Zugriff auf den
Assistenten AFS Server Quick-Start.
</DL>
</LI><P><LI>Ein Dokumentationsverzeichnis wird erstellt, und die Online-Dokumente
<I>IBM AFS f&uuml;r Windows Erste Schritte</I> und <I>IBM AFS for Windows
Release Notes</I> werden in dem Verzeichnis plaziert. Dieses befindet
sich unter <B>\Programme\Ibm\Afs\Documentation</B>.
</LI><P><LI>Die Installationsverzeichnisse, in denen das Konfigurationsprogramm die
AFS-Bin&auml;rdateien, -Symbole und -Hilfedateien installiert, werden
erstellt. Die Standardverzeichnisse sind
<B>\Programme\Ibm\Afs\Server\usr\afs\bin</B> und
<B>\Programme\Ibm\Afs\Common</B>.
</LI><P><LI>Der AFS Server wird als Service registriert.
</LI><P><LI>Die Anwendung AFS Server Configuration wird installiert, und das Symbol
<B>AFS Server Configuration</B> wird der Systemsteuerung hinzugef&uuml;gt,
indem die Datei <B>afsserver.cpl</B> im Verzeichnis
<B>\</B><I>Windows-Standard</I><B>\system32</B> plaziert wird
(<I>Windows-Standard</I> ist hierbei das Windows-Verzeichnis).
</LI><P><LI>Die Windows NT-Registrierungsdatenbank wird modifiziert, indem Eintr&auml;ge
f&uuml;r den AFS Server hinzugef&uuml;gt werden.
</LI></UL>
<P><H4><A NAME="Header_15">&Auml;nderungen am System durch Installation des AFS Control Center</A></H4>
<P>Wenn Sie das AFS Control Center f&uuml;r Windows NT installieren, werden
folgende &Auml;nderungen am System durchgef&uuml;hrt:
<UL>
<P><LI>Im Men&uuml; <B>Start</B> wird die Programmgruppe <B>IBM AFS</B> mit
den folgenden Anwendungen erstellt: 
<DL>
<DD><P>Der Programmeintrag <B>Dokumentation</B> bietet Zugriff auf die
AFS-Online-Dokumentation, die im Lieferumfang von AFS f&uuml;r Windows enthalten
ist.
<DD><P>&Uuml;ber die Programmuntergruppe <B>Control Center</B> haben Sie Zugriff
auf den Account Manager und den Server Manager.
</DL>
</LI><P><LI>Ein Dokumentationsverzeichnis wird erstellt, und die Online-Dokumente
<I>IBM AFS f&uuml;r Windows Erste Schritte</I> und <I>IBM AFS for Windows
Release Notes</I> werden in dem Verzeichnis plaziert. Dieses befindet
sich unter <B>\Programme\Ibm\Afs\Documentation</B>.
</LI><P><LI>Die Installationsverzeichnisse, in denen das Konfigurationsprogramm die
AFS-Bin&auml;rdateien, -Symbole und -Hilfedateien installiert, werden
erstellt. Die Standardverzeichnisse sind
<B>\Programme\Ibm\Afs\Control Center</B> und
<B>\Programme\Ibm\Afs\Common</B>.
</LI><P><LI>Das Dienstprogramm Merkmale f&uuml;r AFS Control Center wird installiert, und
das Symbol <B>AFS Control Center</B> wird der Systemsteuerung hinzugef&uuml;gt,
indem die Datei <B>afs_cpa.cpl</B> im Verzeichnis
<B>\</B><I>Windows-Standard</I><B>\system32</B> plaziert wird
(<I>Windows-Standard</I> ist hierbei das Windows-Verzeichnis). Das
Symbol wird der Systemsteuerung hinzugef&uuml;gt, wenn ausschlie&szlig;lich das AFS
Control Center auf dem System installiert wird.
</LI><P><LI>Die Datei <B>afsdcell.ini</B> wird im Windows-Verzeichnis und
im Verzeichnis <B>\Programme\Ibm\Afs\Common</B> plaziert.
</LI><P><LI>Die Windows NT-Registrierungsdatenbank wird modifiziert, indem Eintr&auml;ge
f&uuml;r das AFS Control Center hinzugef&uuml;gt werden.
</LI></UL>
<P><H4><A NAME="Header_16">&Auml;nderungen am System durch Installation der Komponente AFS Supplemental Documentation</A></H4>
<P>Wenn Sie AFS Supplemental Documentation installieren, werden folgende
&Auml;nderungen am System durchgef&uuml;hrt:
<UL>
<P><LI>Im Men&uuml; <B>Start</B> wird die Programmgruppe <B>IBM AFS</B> mit
dem Eintrag <B>Dokumentation</B> erstellt.
</LI><P><LI>Die folgenden Dokumente zur Systemadministration werden auf dem Computer
installiert: <I>IBM AFS Administration Guide</I> und <I>IBM AFS
Administration Reference</I>. Diese Dokumente werden dem
Online-Dokumentationsverzeichnis hinzugef&uuml;gt, das sich unter
<B>\Programme\Ibm\Afs\Documentation</B> befindet. Au&szlig;erdem werden
die Online-Dokumente <I>IBM AFS f&uuml;r Windows Erste Schritte</I> und
<I>IBM AFS for Windows Release Notes</I> in diesem Verzeichnis
installiert.
</LI><P><LI>Die Windows NT-Registrierungsdatenbank wird modifiziert, indem Eintr&auml;ge
f&uuml;r AFS Supplemental Documentation hinzugef&uuml;gt werden.
</LI></UL>
<HR><H2><A NAME="HDRDOCUMENT" HREF="awqbg002.htm#ToC_17">Die Dokumentation zu AFS f&uuml;r Windows</A></H2>
<P>In diesem Abschnitt erfahren Sie, welche Dokumentation f&uuml;r AFS f&uuml;r
Windows verf&uuml;gbar ist und wie Sie auf diese Dokumentation zugreifen
k&ouml;nnen.
<P><H3><A NAME="Header_18" HREF="awqbg002.htm#ToC_18">Das Verzeichnis f&uuml;r die Online-Dokumentation</A></H3>
<A NAME="IDX215"></A>
<A NAME="IDX216"></A>
<P>Ungeachtet dessen, welche Komponenten Sie auf einem System installieren,
wird ein Verzeichnis f&uuml;r die Dokumentation angelegt. Dieses Verzeichnis
ist standardm&auml;&szlig;ig <B>\Programme\Ibm\Afs\Documentation</B>. Es
enth&auml;lt die Dokumente <I>IBM AFS f&uuml;r Windows Erste Schritte</I> und
<I>IBM AFS for Windows Release Notes</I>. Diese Dokumente sind auch
&uuml;ber den Eintrag <B>Dokumentation</B> im Men&uuml; <B>Start</B>
verf&uuml;gbar.
<P>Wenn Sie AFS Supplemental Documentation installieren, enth&auml;lt das
Dokumentationsverzeichnis au&szlig;erdem die folgenden Dokumente: <I>IBM AFS
Administration Guide</I> und <I>IBM AFS Administration
Reference</I>. Auch diese Dokumente k&ouml;nnen Sie &uuml;ber den Eintrag
<B>Dokumentation</B> im Men&uuml; <B> Start</B> &ouml;ffnen.
<P><H4><A NAME="Header_19">Vorgehensweise zum Zugriff auf das Verzeichnis f&uuml;r die Online-Dokumentation:</A></H4>
<OL TYPE=1>
<P><LI>Zeigen Sie im Men&uuml; <B>Start</B> auf <B>Programme</B>, und klicken
Sie auf <B>IBM AFS</B> und <B>Dokumentation</B>.
</LI><P><LI>W&auml;hlen Sie das gew&uuml;nschte Dokument aus.
</LI></OL>
<P><H3><A NAME="Header_20" HREF="awqbg002.htm#ToC_20">Das Dokumentationsverzeichnis auf der CD-ROM</A></H3>
<A NAME="IDX217"></A>
<A NAME="IDX218"></A>
<P>Die CD-ROM f&uuml;r AFS f&uuml;r Windows enth&auml;lt ein
Dokumentationsverzeichnis. Dieses enth&auml;lt folgende Dokumente:
<I>IBM AFS f&uuml;r Windows Erste Schritte</I>, <I>IBM AFS for Windows
Release Notes</I>, <I>IBM AFS Administration Guide</I> und <I>IBM AFS
Administration Reference</I>. Alle Dokumente liegen im HTML- und im
PDF-Format vor.
<P><H4><A NAME="Header_21">Vorgehensweise zum Zugriff auf das Dokumentationsverzeichnis der CD-ROM:</A></H4>
<OL TYPE=1>
<P><LI>Legen Sie die CD-ROM f&uuml;r AFS f&uuml;r Windows in das CD-ROM-Laufwerk
ein.
</LI><P><LI>F&uuml;hren Sie einen der folgenden Schritte aus, wobei <I>CD</I> der
Laufwerkbuchstabe des CD-ROM-Laufwerks ist. 
<UL>
<P><LI>F&uuml;r die HTML-Dokumentation &ouml;ffnen Sie das Verzeichnis
<I>CD</I><B>:\Documentation\Html</B>.
</LI><P><LI>F&uuml;r die PDF-Dokumentation &ouml;ffnen Sie das Verzeichnis
<I>CD</I><B>:\Documentation\Pdf</B>.
</LI></UL>
</LI></OL>
<P><H3><A NAME="Header_22" HREF="awqbg002.htm#ToC_22">Online-Hilfe</A></H3>
<A NAME="IDX219"></A>
<A NAME="IDX220"></A>
<P>Zusammen mit jeder Komponente von AFS f&uuml;r Windows wird die Online-Hilfe
installiert. Die Online-Hilfe beschreibt die Funktionen der einzelnen
Komponenten. Verwenden Sie das Men&uuml; <B>Hilfe</B> und die
Schaltfl&auml;che <B>Hilfe</B>, die in den meisten Dialogfenstern angeboten
wird, um die Online-Hilfe zu &ouml;ffnen. Wenn Sie Hilfe zu bestimmten
Themen ben&ouml;tigen, durchsuchen Sie die Registerkarte <B>Inhalt</B>.
Auf der Registerkarte <B>Index</B> k&ouml;nnen Sie anhand von Stichw&ouml;rtern nach
Themen suchen, und die Registerkarte <B>Suchen</B> verwenden Sie zum
Durchsuchen der Online-Hilfe nach bestimmten Begriffen.
<HR><H2><A NAME="HDRCONFIGURE" HREF="awqbg002.htm#ToC_23">Konfigurieren von AFS f&uuml;r Windows</A></H2>
<P>
<A NAME="IDX221"></A>
<A NAME="IDX222"></A>
In diesem Abschnitt wird das Verfahren f&uuml;r die Konfiguration der einzelnen
Komponenten von AFS f&uuml;r Windows erl&auml;utert. Um AFS verwenden zu k&ouml;nnen,
m&uuml;ssen die Komponenten auf dem System konfiguriert werden.
<P><H3><A NAME="HDRCLIENT_CONFIG" HREF="awqbg002.htm#ToC_24">Vorgehensweise zum Konfigurieren von AFS Client</A></H3>
<A NAME="IDX223"></A>
<A NAME="IDX224"></A>
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Anmerkung:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">Wenn Sie den AFS Server auf einem Windows NT-System konfigurieren m&ouml;chten,
brauchen Sie den AFS Client nicht zu konfigurieren. Der AFS Client wird
bei der Konfiguration von AFS Server automatisch mit konfiguriert.
Au&szlig;erdem bleiben die Konfigurationsdaten erhalten, wenn Sie eine fr&uuml;here
Version von AFS Client auf diese Version von AFS f&uuml;r Windows erweitern.
Der AFS Client mu&szlig; dann nicht neu konfiguriert werden.
</TD></TR></TABLE>
<OL TYPE=1>
<P><LI>Zeigen Sie im Men&uuml; <B>Start</B> auf <B>Einstellungen</B>, und
klicken Sie auf <B>Systemsteuerung</B>.
</LI><P><LI>Doppelklicken Sie auf das Symbol <B>AFS Client
Configuration</B>. Das Dienstprogramm AFS Client Configuration wird
gestartet, und die Registerkarte <B>Allgemein</B> wird angezeigt.
</LI><P><LI>Geben Sie im Feld <B>Zellenname</B> den Namen der AFS-Zelle ein, in
der der Computer ein Client sein soll.
</LI><P><LI>Klicken Sie auf die Registerkarte <B>AFS-Zellen</B>. Falls die
Zelle, in der der Computer ein Client sein soll, nicht in der Liste der
AFS-Zellen enthalten ist, klicken Sie auf die Schaltfl&auml;che
<B>Hinzuf&uuml;gen</B>. Das Dialogfenster <B>Neue Zelle</B> wird
ge&ouml;ffnet. Geben Sie im Feld <B>AFS-Zelle</B> den Zellennamen ein
und im Feld <B>Beschreibung</B> eine kurze Beschreibung. 
<P>Klicken Sie auf die Schaltfl&auml;che <B>Hinzuf&uuml;gen</B>. Das
Dialogfenster <B>Server hinzuf&uuml;gen</B> wird ge&ouml;ffnet. Geben Sie im
Feld <B>Server-Name</B> den Namen eines Volume Location Servers in der
ausgew&auml;hlten Zelle ein. Klicken Sie auf <B>OK</B>, um das
Dialogfenster <B>Server hinzuf&uuml;gen</B> zu schlie&szlig;en. Wiederholen
Sie diesen Vorgang, um die Informationen f&uuml;r alle Volume Location Server in
der Zelle hinzuzuf&uuml;gen. Falls Sie die Namen der Volume Location Server
in der AFS-Zelle nicht kennen, wenden Sie sich an Ihren
AFS-Systemadministrator. Nachdem Sie alle Server-Daten eingegeben
haben, klicken Sie auf <B>OK</B>, um das Dialogfenster <B>Neue
Zelle</B> zu schlie&szlig;en.
</LI><P><LI>Klicken Sie auf der Registerkarte <B>Allgemein</B> auf die
Schaltfl&auml;che <B>Service starten</B>, um den AFS Client zu starten.
</LI><P><LI>Klicken Sie auf die Registerkarte <B>Laufwerkbuchstaben</B>. Um
einen Laufwerkbuchstaben auf dem Windows NT-Computer dem AFS-Dateibereich
zuzuordnen, klicken Sie auf die Schaltfl&auml;che <B>Hinzuf&uuml;gen</B>. Das
Dialogfenster <B>Laufwerkbuchstabe zuordnen</B> wird ge&ouml;ffnet.
</LI><P><LI>W&auml;hlen Sie im Listenfeld <B>Laufwerkbuchstabe</B> das Laufwerk aus,
das dem AFS-Dateibereich zugeordnet werden soll, oder &uuml;bernehmen Sie den
Standardeintrag. Geben Sie im Feld <B>AFS-</B><B>Pfad</B> das
AFS-Verzeichnis an, dem Sie das ausgew&auml;hlte Laufwerk zuordnen m&ouml;chten,
z.B. <B>/afs</B>. Falls gew&uuml;nscht, geben Sie im Feld
<B>Beschreibung</B> eine Beschreibung der AFS-Zuordnung ein.
Klicken Sie auf <B>OK</B>, um das Laufwerk mit dem angegebenen Verzeichnis
im AFS-Dateibereich zu verbinden.
</LI><P><LI>Klicken Sie auf <B>OK</B>, um das Dienstprogramm AFS Client
Configuration zu beenden. 
<P>Der AFS Client ist jetzt in der ausgew&auml;hlten AFS-Zelle konfiguriert, und
Sie k&ouml;nnen &uuml;ber die ausgew&auml;hlte Laufwerkzuordnung im Windows NT-Explorer auf
den AFS-Dateibereich zugreifen.
</LI></OL>
<P><H3><A NAME="HDRGATEWAY" HREF="awqbg002.htm#ToC_25">Vorgehensweise zum Konfigurieren von AFS Client als AFS Light Gateway</A></H3>
<A NAME="IDX225"></A>
<A NAME="IDX226"></A>
<A NAME="IDX227"></A>
<P>Sie k&ouml;nnen den AFS Client so auf einer Windows NT-Maschine konfigurieren,
da&szlig; er als AFS Light Gateway fungiert. Ist der AFS Client als AFS Light
Gateway konfiguriert, k&ouml;nnen Benutzer von AFS Light auf den AFS-Dateibereich
zugreifen.
<OL TYPE=1>
<P><LI>Konfigurieren Sie den AFS Client, wie im Abschnitt <A HREF="#HDRCLIENT_CONFIG">Vorgehensweise zum Konfigurieren von AFS Client</A> beschrieben.
</LI><P><LI>Zeigen Sie im Men&uuml; <B>Start</B> auf <B>Einstellungen</B>, und
klicken Sie auf <B>Systemsteuerung</B>.
</LI><P><LI>Doppelklicken Sie auf das Symbol <B>AFS Client
Configuration</B>. Das Dienstprogramm AFS Client Configuration wird
gestartet, und die Registerkarte <B>Allgemein</B> wird angezeigt.
</LI><P><LI>W&auml;hlen Sie die Option <B>AFS Light Gateway bereitstellen</B>.
</LI><P><LI>Klicken Sie auf <B>OK</B>. 
<UL>
<P><LI>Wenn der AFS Client aktiv ist, wird eine Meldung mit dem Hinweis
angezeigt, da&szlig; Sie den Service erneut starten m&uuml;ssen. Klicken Sie auf
<B>Ja</B>, um den AFS Client erneut zu starten und das AFS Light Gateway
zu aktivieren.
</LI><P><LI>Falls der AFS Client gestoppt wurde, erhalten Sie eine Meldung mit dem
Hinweis, da&szlig; Sie diesen Service starten m&uuml;ssen. Klicken Sie auf
<B>Ja</B>, um den AFS Client zu starten und das AFS Light Gateway zu
aktivieren.
</LI></UL>
</LI><P><LI>
<A NAME="IDX228"></A>
F&uuml;gen Sie der Zellendatenbank des AFS Light Gateways Zelleneintr&auml;ge
hinzu. Beachten Sie folgendes: Damit ein AFS Light-Benutzer auf
eine Zelle zugreifen kann, mu&szlig; ein Eintrag f&uuml;r diese Zelle sowohl in der
Zellendatenbank von AFS Light als auch in der Zellendatenbank von AFS Light
Gateway existieren. Falsche oder fehlende Informationen &uuml;ber eine Zelle
in der Zellendatenbank der Gateway-Maschine haben zur Folge, da&szlig; Light-Clients
nicht auf Dateien zugreifen k&ouml;nnen. 
<P><B>Vorgehensweise zum Einf&uuml;gen eines Eintrags zur
Zellendatenbank:</B>
<P>&Ouml;ffnen Sie im Dienstprogramm AFS Light Configuration die Registerkarte
<B>AFS-Zellen</B>, und klicken Sie auf die Schaltfl&auml;che
<B>Hinzuf&uuml;gen</B>. Das Dialogfenster <B>Neue Zelle</B> wird
ge&ouml;ffnet. Geben Sie im Feld <B>AFS-Zelle</B> den Zellennamen ein
und im Feld <B>Beschreibung</B> eine kurze Beschreibung.
<P>Klicken Sie auf die Schaltfl&auml;che <B>Hinzuf&uuml;gen</B>. Das
Dialogfenster <B>Server hinzuf&uuml;gen</B> wird ge&ouml;ffnet. Geben Sie im
Feld <B>Server-Name</B> den Namen eines Volume Location Servers in der
ausgew&auml;hlten Zelle ein. Klicken Sie auf <B>OK</B>, um das
Dialogfenster <B>Server hinzuf&uuml;gen</B> zu schlie&szlig;en. Wiederholen
Sie diesen Vorgang, um die Informationen f&uuml;r alle Volume Location Server in
der Zelle hinzuzuf&uuml;gen. Falls Sie die Namen der Volume Location Server
in der AFS-Zelle nicht kennen, wenden Sie sich an Ihren
AFS-Systemadministrator. Nachdem Sie alle Server-Daten eingegeben
haben, klicken Sie auf <B>OK</B>, um das Dialogfenster <B>Neue
Zelle</B> zu schlie&szlig;en.
</LI></OL>
<P>
<A NAME="IDX229"></A>
<A NAME="IDX230"></A>
<A NAME="IDX231"></A>
Der Windows NT-Computer ist nun als AFS Light Gateway konfiguriert.
Sobald der AFS Client-Computer als AFS Light Gateway konfiguriert worden ist,
mu&szlig; er in der Lage sein, Benutzer von AFS Light in einem Windows-Kontext zu
authentifizieren. Diese Authentifizierung erfolgt &uuml;ber ein
<I>Dom&auml;nen</I>-Benutzerkonto oder &uuml;ber ein synchronisiertes
<I>Maschinen</I>-Benutzerkonto. Ein Dom&auml;nen-Benutzerkonto ist ein
Benutzerkonto in einer Windows-Dom&auml;ne. Ein Maschinen-Benutzerkonto ist
ein Benutzerkonto, das nur auf einem bestimmten Host-Computer g&uuml;ltig
ist.
<P>Wenn das AFS Light Gateway in einer Windows-Dom&auml;ne konfiguriert ist, mu&szlig;
der AFS Light-Benutzer sich entweder bei einem Dom&auml;nen-Benutzerkonto in der
Dom&auml;ne anmelden, zu der das Gateway geh&ouml;rt, oder bei einem
Maschinen-Benutzerkonto, das den gleichen Benutzernamen und das gleiche
Kennwort hat wie ein Dom&auml;nen-Benutzerkonto in der Gateway-Dom&auml;ne.
<P>Werden Maschinen-Benutzerkonten verwendet, m&uuml;ssen diese Konten zwischen dem
AFS Light Gateway- und dem AFS Light-Computer synchronisiert werden.
Der Benutzer mu&szlig; sich auf einem AFS Light-Computer mit dem gleichen
Benutzernamen und Kennwort anmelden, das auch f&uuml;r ein Maschinen-Benutzerkonto
gilt, das auf dem AFS Light Gateway-Maschine definiert ist.
<P><H3><A NAME="Header_26" HREF="awqbg002.htm#ToC_26">Vorgehensweise zum Konfigurieren von AFS Light</A></H3>
<A NAME="IDX232"></A>
<A NAME="IDX233"></A>
<P>AFS Light greift &uuml;ber ein AFS Light Gateway auf den AFS-Dateibereich
zu. Damit Sie AFS Light konfigurieren k&ouml;nnen, ben&ouml;tigen Sie einen
Windows NT-Computer, auf dem der AFS Client ausgef&uuml;hrt wird, und der als AFS
Light Gateway konfiguriert ist. Weitere Informationen hierzu finden Sie
im Abschnitt <A HREF="#HDRGATEWAY">Vorgehensweise zum Konfigurieren von AFS Client als AFS Light Gateway</A>.
<OL TYPE=1>
<P><LI>Zeigen Sie im Men&uuml; <B>Start</B> auf <B>Einstellungen</B>, und
klicken Sie auf <B>Systemsteuerung</B>.
</LI><P><LI>Doppelklicken Sie auf das Symbol <B>AFS Light
Configuration</B>. Das Dienstprogramm AFS Light Configuration wird
gestartet, und die Registerkarte <B>Allgemein</B> wird angezeigt.
<A NAME="IDX234"></A>
<A NAME="IDX235"></A>
</LI><P><LI>Geben Sie im Feld <B>Gateway</B> den Namen einer Windows NT-Maschine
an, die als AFS Light Gateway konfiguriert ist, und klicken Sie auf <B>Jetzt
verbinden</B>. Der Name der Gateway-Maschine ist der
NetBIOS-Servicename des Gateways im Format
<I>Maschine</I><B>-afs</B>, wobei <I>Maschine</I> der Name
des Host-Computers mit maximal 11 Zeichen L&auml;nge ist. AFS Light mu&szlig;
diesen Servicenamen aufl&ouml;sen k&ouml;nnen, um mit der Gateway-Maschine zu
kommunizieren. Damit die Namensaufl&ouml;sung erfolgt, m&uuml;ssen Sie den
NetBIOS-Servicenamen des Gateways der LMHOSTS-Datei des Clients oder den
entsprechenden DNS- oder WINS-Servern hinzuf&uuml;gen. Befinden sich die AFS
Light-Maschine und die zugeh&ouml;rige AFS Light Gateway-Maschine im gleichen
Teilnetz, ist keine weitere Konfiguration erforderlich. 
<P>AFS Light wird automatisch Mitglied der gleichen Zelle wie das AFS Light
Gateway. Der Name der Zelle wird im Feld <B>Zellenname</B>
angezeigt.
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Anmerkung:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">Wenn die AFS Light Gateway-Maschine sich in der gleichen Dom&auml;ne befindet wie
die AFS Light-Maschine und der Host-Name der Gateway-Maschine in der Dom&auml;ne
<B>xyz-pc</B> ist, k&ouml;nnen Sie f&uuml;r den Computernamen im Feld
<B>Gateway</B> entweder <B>xyz-pc</B> oder
<B>xyz-pc.xcompany.com</B> eingeben.
</TD></TR></TABLE>
</LI><P><LI>Klicken Sie auf die Registerkarte <B>AFS-Zellen</B>. Falls die
Zelle, zu der die Maschine geh&ouml;rt, nicht in der Liste der AFS-Zellen enthalten
ist, klicken Sie auf die Schaltfl&auml;che <B>Hinzuf&uuml;gen</B>. Das
Dialogfenster <B>Neue Zelle</B> wird ge&ouml;ffnet. Geben Sie im Feld
<B>AFS-Zelle</B> den Zellennamen ein und im Feld <B>Beschreibung</B>
eine kurze Beschreibung. 
<P>Klicken Sie auf die Schaltfl&auml;che <B>Hinzuf&uuml;gen</B>. Das
Dialogfenster <B>Server hinzuf&uuml;gen</B> wird ge&ouml;ffnet. Geben Sie im
Feld <B>Server-Name</B> den Namen eines Volume Location Servers in der
ausgew&auml;hlten Zelle ein. Klicken Sie auf <B>OK</B>, um das
Dialogfenster <B>Server hinzuf&uuml;gen</B> zu schlie&szlig;en. Wiederholen
Sie diesen Vorgang, um die Informationen f&uuml;r alle Volume Location Server in
der Zelle hinzuzuf&uuml;gen. Falls Sie die Namen der Volume Location Server
in der AFS-Zelle nicht kennen, wenden Sie sich an den
AFS-Systemadministrator. Nachdem Sie alle Server-Daten eingegeben
haben, klicken Sie auf <B>OK</B>, um das Dialogfenster <B>Neue
Zelle</B> zu schlie&szlig;en.
<P>Beachten Sie, da&szlig; ein identischer Eintrag in der Zellendatenbank des AFS
Light Gateways (Datei <B>afsdcell.ini</B>) existieren mu&szlig;, damit
der AFS Light-Benutzer sich bei der Zelle authentifizieren kann.
Weitere Informationen zur Synchronisierung der Zellendatenbank der
Gateway-Maschine mit der Zellendatenbank des Light-Clients finden Sie im
Abschnitt <A HREF="#HDRGATEWAY">Vorgehensweise zum Konfigurieren von AFS Client als AFS Light Gateway</A>.
</LI><P><LI>Klicken Sie auf die Registerkarte <B>Laufwerkbuchstaben</B>. Um
einen Laufwerkbuchstaben auf der Windows-Maschine dem AFS-Dateibereich
zuzuordnen, klicken Sie auf die Schaltfl&auml;che <B>Hinzuf&uuml;gen</B>. Das
Dialogfenster <B>Laufwerkbuchstabe zuordnen</B> wird ge&ouml;ffnet.
</LI><P><LI>W&auml;hlen Sie im Listenfeld <B>Laufwerkbuchstabe</B> das Laufwerk aus,
das dem AFS-Dateibereich zugeordnet werden soll, oder &uuml;bernehmen Sie den
Standardeintrag. Geben Sie im Feld <B>AFS-</B><B>Pfad</B> das
AFS-Verzeichnis an, dem Sie das ausgew&auml;hlte Laufwerk zuordnen m&ouml;chten,
z.B. <B>/afs</B>. Falls gew&uuml;nscht, geben Sie im Feld
<B>Beschreibung</B> eine Beschreibung der AFS-Zuordnung ein.
Klicken Sie auf <B>OK</B>, um das Laufwerk mit dem angegebenen Verzeichnis
im AFS-Dateibereich zu verbinden.
</LI><P><LI>Klicken Sie auf <B>OK</B>, um das Dienstprogramm AFS Light
Configuration zu beenden.
<P>AFS Light ist jetzt in der angegebenen AFS-Zelle konfiguriert, und Sie
k&ouml;nnen &uuml;ber die ausgew&auml;hlte Laufwerkzuordnung im Windows-Explorer auf den
AFS-Dateibereich zugreifen.
</LI></OL>
<P><H3><A NAME="Header_27" HREF="awqbg002.htm#ToC_27">Vorgehensweise zum Konfigurieren von AFS Server</A></H3>
<A NAME="IDX236"></A>
<A NAME="IDX237"></A>
<P>Durch den Konfigurationsproze&szlig; werden die zur Ausf&uuml;hrung von AFS Server
ben&ouml;tigten Services gestartet und AFS-Partitionen auf der Windows NT-Maschine
eingerichtet. Mit dem Assistenten AFS Configuration k&ouml;nnen Sie den AFS
Server rasch entweder als ersten Server in einer neuen AFS-Zelle oder als
Server in einer vorhandenen AFS-Zelle konfigurieren. Wenn Sie eine
bisherige Version auf die neue Version von AFS Server erweitern, bleiben die
Konfigurationsdaten der fr&uuml;heren Version erhalten, d.h. Sie
brauchen den Server nicht neu zu konfigurieren.
<P><B>
<A NAME="IDX238"></A>
Vorgehensweise zum Konfigurieren von AFS Server als ersten AFS Server in einer
Zelle:</B>
<OL TYPE=1>
<P><LI>Zeigen Sie im Men&uuml; <B>Start</B> auf <B>Programme</B>, klicken Sie
auf <B>IBM AFS</B>, dann auf <B>Server</B> und anschlie&szlig;end auf
<B>Konfigurationsassistent</B>. Der Assistent AFS Server
Quick-Start wird gestartet.
</LI><P><LI>Klicken Sie auf die Schaltfl&auml;che <B>Weiter</B>. Das
Dialogfenster <B>Zellen- und Server-Informationen</B> wird
angezeigt.
</LI><P><LI>W&auml;hlen Sie die Option <B>Dies wird der erste Server in einer neuen
AFS-Zelle</B>.
</LI><P><LI>Geben Sie im Feld <B>Zellenname</B> einen Namen f&uuml;r die neue AFS-Zelle
ein. 
<P>Folgende Beschr&auml;nkungen gelten f&uuml;r das Format eines Internet-Dom&auml;nennamens,
der als Name einer AFS-Zelle dienen kann: 
<UL>
<P><LI>Der Zellenname mu&szlig; eindeutig sein, damit diese AFS-Zelle von allen anderen
im globalen AFS-Namespace unterschieden werden kann.
</LI><P><LI>Der Zellenname darf maximal 64 Zeichen lang sein, k&uuml;rzere Namen sind
jedoch vorzuziehen.
</LI><P><LI>Der Zellenname darf nur Kleinbuchstaben, Zahlen, Unterstriche,
Bindestriche und Punkte enthalten, um &Uuml;bertragbarkeit zwischen verschiedenen
Betriebssystemen zu gew&auml;hrleisten.
</LI><P><LI>Der Zellenname kann beliebige Zahlen oder Buchstaben enthalten, die
standardm&auml;&szlig;ig durch Punkte voneinander getrennt werden.
</LI><P><LI>Der Zellenname mu&szlig; mit einem Suffix enden, das die Art der Organisation
angibt, zu der die Zelle geh&ouml;rt. Standardsuffixe sind
z.B. <B>.com</B> f&uuml;r Organisationen in Wirtschaft und
Handel, <B>.edu</B> f&uuml;r Bildungseinrichtungen wie Universit&auml;ten,
<B>.gov</B> f&uuml;r Regierungsbeh&ouml;rden und <B>.mil</B> f&uuml;r
milit&auml;rische Organisationen.
</LI></UL>
</LI><P><LI>Geben Sie im Feld <B>Kennwort</B> die Zeichenfolge ein, die als
Kennwort f&uuml;r das Principal-Konto von AFS Server in der Zelle (<B>afs</B>)
dienen soll. Alle AFS Server rufen AFS-Token bei diesem Principal ab,
und der Ticket Granting Service (TGS) des Authentifizierungs-Servers verwendet
dieses Kennwort, um die Server-Zugriffsberechtigungen zu verschl&uuml;sseln, die
die AFS Clients den Servern bei der gegenseitigen Authentifizierung
vorlegen.
</LI><P><LI>Geben Sie im Feld <B>Pr&uuml;fkennwort</B> erneut das erste AFS-Kennwort
f&uuml;r das Principal-Konto von AFS Server f&uuml;r diese Zelle ein, um es zu
best&auml;tigen.
</LI><P><LI>Klicken Sie auf die Schaltfl&auml;che <B>Weiter</B>. Das
Dialogfenster <B>Verwaltungsinformationen</B> wird angezeigt.
</LI><P><LI>Geben Sie im Feld <B>Name</B> einen Benutzernamen ein, der als
generisches AFS-Verwaltungskonto f&uuml;r diese Zelle dienen soll (meist <B>
admin</B>). 
<P>
<A NAME="IDX239"></A>
Wenn Sie ein generisches Verwaltungskonto verwenden, brauchen Sie nicht jedem
Systemadministrator einzeln Berechtigungen zu erteilen. Vielmehr kennt
jeder Administrator den Namen und das Kennwort dieses generischen
Verwaltungskontos und verwendet diese Identit&auml;t, um sich bei AFS zu
authentifizieren, wenn er Vorg&auml;nge ausf&uuml;hrt, f&uuml;r die
Administratorberechtigungen ben&ouml;tigt werden.
</LI><P><LI>Geben Sie im Feld <B>Kennwort</B> eine Zeichenfolge ein, die als
Kennwort f&uuml;r das AFS-Verwaltungskonto dienen soll.
</LI><P><LI>Geben Sie im Feld <B>Pr&uuml;fkennwort</B> erneut das Kennwort f&uuml;r das
AFS-Verwaltungskonto ein, um es zu best&auml;tigen.
</LI><P><LI>Geben Sie die AFS-Benutzer-ID (AFS-UID) ein, die dem AFS-Verwaltungskonto
zugeordnet werden soll: 
<UL>
<P><LI>(Empfohlen) Soll dem AFS-Verwaltungskonto automatisch die n&auml;chste
verf&uuml;gbare UID zugeordnet werden, w&auml;hlen Sie die Option <B>Die n&auml;chste
verf&uuml;gbare AFS UID verwenden</B>.
</LI><P><LI>Wenn Sie dem AFS-Verwaltungskonto eine bestimmte UID zuweisen m&ouml;chten,
w&auml;hlen Sie die Option <B>Diese AFS UID verwenden:</B> und geben die
gew&uuml;nschte UID in das Eingabefeld ein. 
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Anmerkung:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">Es ist im allgemeinen nicht empfehlenswert, einem neuen AFS-Konto eine
spezielle UID zuzuweisen, es sei denn, die AFS-UID mu&szlig; mit einer vorhandenen
UNIX-UID &uuml;bereinstimmen.
</TD></TR></TABLE>
</LI></UL>
</LI><P><LI>Klicken Sie auf die Schaltfl&auml;che <B>Weiter</B>. Das
Dialogfenster <B>File Service</B> wird angezeigt.
<P>
<A NAME="IDX240"></A>
AFS File Server stellen von AFS Clients angeforderte Dateien und Daten vom
Server bereit. Sie speichern Dateien und Daten, verarbeiten
Anforderungen f&uuml;r das Kopieren, Verschieben, Erstellen und L&ouml;schen von Dateien
und Verzeichnissen und zeichnen Statusinformationen &uuml;ber die einzelnen Dateien
und Verzeichnisse auf dem Server auf.
<P>Da Sie den ersten AFS Server in einer neuen Zelle konfigurieren, mu&szlig; der
File Service auf dem Server konfiguriert werden. Dies geschieht
automatisch.
</LI><P><LI>Klicken Sie auf die Schaltfl&auml;che <B>Weiter</B>. Das
Dialogfenster <B>Database Service</B> wird angezeigt. 
<P>
<A NAME="IDX241"></A>
Jede AFS-Zelle mu&szlig; mindestens einen Database Server enthalten. Jeder
Database Server f&uuml;hrt die Datenbankprozesse aus, mit denen die AFS-Datenbanken
(Authentication-, Protection-, Volume Location- und ggf.
Backup-Datenbank) verwaltet werden.
<P>Da Sie den ersten AFS Server in einer neuen Zelle konfigurieren, mu&szlig; der
Database Service auf dem Server konfiguriert werden. Dies geschieht
automatisch.
</LI><P><LI>Klicken Sie auf die Schaltfl&auml;che <B>Weiter</B>. Das
Dialogfenster <B>Backup-Server</B> wird angezeigt. 
<P>
<A NAME="IDX242"></A>
Ein Backup-Server verwaltet die Backup-Datenbank, in der Informationen im
Zusammenhang mit dem Backup-System gespeichert werden. Mit Hilfe des
Backup-Servers kann der AFS-Systemadministrator Daten im AFS-Dateibereich von
den Volumes auf Band sichern. Diese Daten k&ouml;nnen vom Band
wiederhergestellt werden, falls sie im Dateisystem verlorengehen
(z.B. bei Datenverlust durch Systemausfall oder
Festplattenfehler).
</LI><P><LI>W&auml;hlen Sie die Option <B>Als Backup-Server konfigurieren</B>, wenn Sie
diesen AFS Server als Backup-Server konfigurieren m&ouml;chten. Andernfalls
w&auml;hlen Sie die Option <B>Nicht als Backup-Server konfigurieren</B>.
<P>
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Anmerkung:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">Ist der Backup-Server auf irgendeinem Database Server in der Zelle
konfiguriert, mu&szlig; er auf <I>allen</I> Database Servern in der Zelle
konfiguriert werden.
</TD></TR></TABLE>
</LI><P><LI>Klicken Sie auf die Schaltfl&auml;che <B>Weiter</B>. Das
Dialogfenster <B>AFS-Partition</B> wird angezeigt. 
<P>
<A NAME="IDX243"></A>
 Jeder AFS File Server mu&szlig; mindestens eine Partition besitzen, die
ausschlie&szlig;lich f&uuml;r die Speicherung von AFS-Volumes reserviert ist. Alle
AFS-Volumes m&uuml;ssen sich auf Partitionen befinden, die als AFS-Partitionen
eingerichtet wurden. Auf einem Windows NT-Computer k&ouml;nnen nur
NTFS-Volumes als AFS-Partitionen eingerichtet werden. Au&szlig;erdem k&ouml;nnen
AFS-Partitionen nur auf NTFS-Volumes erstellt werden, die leer sind (oder nur
den Windows NT-Papierkorb enthalten).
<P>Da Sie den ersten AFS Server in einer neuen Zelle konfigurieren, m&uuml;ssen Sie
auf dem Server eine AFS-Partition festlegen.
</LI><P><LI>W&auml;hlen Sie in der Liste der NTFS-Volumes das Volume aus, das Sie als
AFS-Partition einrichten m&ouml;chten. Geben Sie im Feld
<B>AFS-Partitionsname</B> den letzten Teil des Partitionsnamens
ein.
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Anmerkung:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">Auf einem AFS Server k&ouml;nnen bis zu 256 AFS-Partitionen existieren.
Standardm&auml;&szlig;ig hat eine Partition den Namen <B>/vicep</B><I>x</I>,
wobei <I>x</I> f&uuml;r einen oder zwei Kleinbuchstaben steht.
AFS-Partitionen k&ouml;nnen <B>/vicepa</B>, <B>/vicepb</B> usw. bis
<B>/vicepz</B> hei&szlig;en. Zus&auml;tzliche Partitionen k&ouml;nnen mit
<B>/vicepaa</B> bis <B>vicepaz</B> usw. bis <B>/vicepiv</B>
benannt werden.
</TD></TR></TABLE>
<P>Es wird unbedingt empfohlen, den Laufwerkbuchstaben des NTFS-Volumes als
letzten Buchstaben des Partitionsnamens zu verwenden.
</LI><P><LI>Klicken Sie auf die Schaltfl&auml;che <B>Weiter</B>. Das
Dialogfenster <B>AFS-Root-Volumes</B> wird angezeigt. 
<P>
<A NAME="IDX244"></A>
<A NAME="IDX245"></A>
<A NAME="IDX246"></A>
Die AFS-Root-Volumes sind zwei Volumes, die im Dateisystem jeder AFS-Zelle
enthalten sein m&uuml;ssen. Sie haben folgende Namen:
<UL>
<P><LI><B>root.afs</B>: das Volume, das der obersten Ebene
(<B>/afs</B>) des AFS-Dateibereichs entspricht.
</LI><P><LI><B>root.cell</B>: das Volume, das direkt unter
<B>/afs</B> am Namen der Zelle angeh&auml;ngt ist (z.B.
<B>/afs/meinefirma.com</B> in der Zelle
<B>meinefirma.com</B>).
</LI></UL>
<P>Da Sie den ersten AFS Server in einer neuen Zelle konfigurieren, m&uuml;ssen
die Root-Volumes der Zelle auf dem Server erstellt werden. Dies
geschieht w&auml;hrend der Konfiguration des Servers automatisch.
</LI><P><LI>Klicken Sie auf die Schaltfl&auml;che <B>Weiter</B>. Das
Dialogfenster <B>Nachbildung</B> wird angezeigt. 
<P>
<A NAME="IDX247"></A>
Wenn Sie die Nachbildungsfunktionen von AFS nutzen m&ouml;chten, m&uuml;ssen die
AFS-Root-Volumes repliziert werden. Bei der Nachbidung werden eine oder
mehrere schreibgesch&uuml;tzte Kopien eines AFS-Volumes erstellt und an einen oder
mehrere andere Standorte verteilt (AFS-Partitionen und -Server). Die
Nachbildung f&uuml;hrt zu einer Steigerung der Systemleistung und zu einer besseren
Datenverf&uuml;gbarkeit, da sie den Inhalt eines AFS-Volumes auf einem oder
mehreren AFS File Server-Computern zur Verf&uuml;gung stellt.
<P>Da Sie den ersten AFS Server in einer neuen Zelle konfigurieren, m&uuml;ssen die
Root-Volumes der Zelle auf dem Server repliziert werden. Dies geschieht
automatisch w&auml;hrend der Konfiguration des Servers.
</LI><P><LI>Klicken Sie auf die Schaltfl&auml;che <B>Weiter</B>. Das
Dialogfenster <B>System Control Service</B> wird angezeigt. 
<P>
<A NAME="IDX248"></A>
In Zellen, in denen die landesspezifische Version von AFS f&uuml;r Windows
ausgef&uuml;hrt wird, verteilt der System Control Server neue Versionen der AFS
Server-Konfigurationsdaten an alle AFS-Server. Es empfiehlt sich
grunds&auml;tzlich, den ersten Server in einer AFS-Zelle als System Control Server
zu definieren. (Bei Zellen, in denen die internationale Version von AFS
f&uuml;r Windows ausgef&uuml;hrt wird, wird der System Control Server nicht zum
Verteilen der Systemkonfigurationsdaten verwendet.) 
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Anmerkung:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">Die Rolle des System Control Servers kann sp&auml;ter bei Bedarf einem anderen
Server zugeordnet werden. Je nach Anzahl der AFS-Server in der Zelle
kann die Zuweisung der Rolle zu einem anderen Computer jedoch sehr
zeitaufwendig sein.
</TD></TR></TABLE>
</LI><P><LI>Um diesen AFS Server als System Control Server f&uuml;r die AFS-Zelle zu
konfigurieren, w&auml;hlen Sie die Option <B>Als System Control Server
konfigurieren</B>. Andernfalls w&auml;hlen Sie die Option <B>Nicht als
System Control Server konfigurieren</B>.
</LI><P><LI>Klicken Sie auf die Schaltfl&auml;che <B>Weiter</B>. Das
Dialogfenster <B>Das System konfigurieren</B> wird angezeigt. 
<P>Eine Liste der Konfigurationsschritte f&uuml;r den AFS Server wird
angezeigt. Lesen Sie sich die Schritte durch, bevor Sie mit dem
Konfigurationsproze&szlig; beginnen. 
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Anmerkung:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">Um zu einem vorherigen Schritt zur&uuml;ckzukehren oder Ihre Auswahl zu &auml;ndern,
klicken Sie auf die Schaltfl&auml;che <B>Zur&uuml;ck</B>.
</TD></TR></TABLE>
</LI><P><LI>Um mit der Konfiguration von AFS Server auf dieser Maschine zu beginnen,
klicken Sie auf die Schaltfl&auml;che <B>Konfigurieren</B>. Der AFS
Server wird gem&auml;&szlig; Ihren Angaben konfiguriert. Der Statusbalken am
unteren Rand des Dialogfensters zeigt an, welche Schritte gerade ausgef&uuml;hrt
werden. Anschlie&szlig;end wird eine Meldung mit dem Hinweis angezeigt, da&szlig;
die Konfiguration abgeschlossen ist.
</LI></OL>
<P>
<A NAME="IDX249"></A>
<B>Vorgehensweise zum Konfigurieren von AFS Server in einer vorhandenen
AFS-Zelle:</B>
<OL TYPE=1>
<P><LI>Zeigen Sie im Men&uuml; <B>Start</B> auf <B>Programme</B>, klicken Sie
auf <B>IBM AFS</B>, dann auf <B>Server</B> und anschlie&szlig;end auf
<B>Konfigurationsassistent</B>. Der Assistent AFS Server
Quick-Start wird gestartet.
</LI><P><LI>Klicken Sie auf die Schaltfl&auml;che <B>Weiter</B>. Das
Dialogfenster <B>Zellen- und Server-Informationen</B> wird
angezeigt.
</LI><P><LI>W&auml;hlen Sie die Option <B>Diesen Host zu einem Server in einer
vorhandenen AFS-Zelle machen</B>.
</LI><P><LI>Geben Sie im Feld <B>Zellenname</B> den Namen der AFS-Zelle ein, der
Sie den neuen AFS Server hinzuf&uuml;gen m&ouml;chten.
</LI><P><LI>Klicken Sie auf die Schaltfl&auml;che <B>Weiter</B>. Das
Dialogfenster <B>Verwaltungsinformationen</B> wird angezeigt.
</LI><P><LI>Geben Sie im Feld <B>Name</B> den Benutzernamen des
AFS-Verwaltungskontos ein, z.B. <B>admin</B>, oder den
Benutzernamen eines AFS-Benutzerkontos mit Administratorberechtigungen.
</LI><P><LI>Geben Sie im Feld <B>Kennwort</B> den Benutzernamen des
AFS-Verwaltungskontos ein, z.B. <B>admin</B>, oder den
Benutzernamen eines AFS-Benutzerkontos mit Administratorberechtigungen.
</LI><P><LI>Geben Sie im Feld <B>AFS Server</B> den Host-Namen eines aktiven AFS
Servers in dieser AFS-Zelle ein. Die AFS-Konfigurationsdaten werden vom
Server abgerufen und angewendet, wenn der neue AFS Server konfiguriert
wird.
</LI><P><LI>Klicken Sie auf die Schaltfl&auml;che <B>Weiter</B>. Das
Dialogfenster <B>File Service</B> wird angezeigt.
<P>
<A NAME="IDX250"></A>
AFS File Server stellen AFS Clients angeforderte Dateien und Daten vom Server
bereit. Sie speichern Dateien und Daten, verarbeiten Anforderungen f&uuml;r
das Kopieren, Verschieben, Erstellen und L&ouml;schen und Dateien und
Verzeichnissen und zeichnen Statusinformationen &uuml;ber die einzelnen Dateien und
Verzeichnisse auf dem Server auf.
<P>Um diesen AFS Server als File Server zu konfigurieren, w&auml;hlen Sie die
Option <B>Als File Server konfigurieren</B>. Andernfalls w&auml;hlen Sie
die Option <B>Nicht als File Server konfigurieren</B>.
</LI><P><LI>Klicken Sie auf die Schaltfl&auml;che <B>Weiter</B>. Das
Dialogfenster <B>Database Service</B> wird angezeigt. 
<P>
<A NAME="IDX251"></A>
Jede AFS-Zelle mu&szlig; mindestens einen Database Server enthalten. Jeder
Database Server f&uuml;hrt die Datenbankprozesse aus, mit denen die AFS-Datenbanken
(Authentication-, Protection-, Volume Location- und ggf.
Backup-Datenbank) verwaltet werden.
<P>Um diesen AFS Server als Database Server zu konfigurieren, w&auml;hlen Sie die
Option <B>Als Database Server konfigurieren</B>. Falls in der
AFS-Zelle, der Sie den Server hinzuf&uuml;gen, ein System Control Server vorhanden
ist, geben Sie dessen Host-Namen im Feld <B>System Control Server</B>
ein. Die AFS-Konfigurationsdaten (z.B. die Liste der AFS
Database Server, die in der Datei <B>CellServDB</B> auf jeder AFS
Server-Maschine gespeichert wird) werden durch diesen Server
aktualisiert. Wenn Sie diesen AFS Server nicht als Database Server
konfigurieren m&ouml;chten, w&auml;hlen Sie die Option <B>Nicht als Database Server
konfigurieren</B>.
</LI><P><LI>Klicken Sie auf die Schaltfl&auml;che <B>Weiter</B>. Das
Dialogfenster <B>Backup-Server</B> wird angezeigt. 
<P>
<A NAME="IDX252"></A>
Ein Backup-Server verwaltet die Backup-Datenbank, in der Informationen im
Zusammenhang mit dem Backup-System gespeichert werden. Mit Hilfe des
Backup-Servers kann der AFS-Systemadministrator Daten im AFS-Dateibereich von
den Volumes auf Band sichern. Diese Daten k&ouml;nnen vom Band
wiederhergestellt werden, falls sie im Dateisystem verlorengehen
(z.B. bei Datenverlust durch Systemausfall oder
Festplattenfehler). 
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Anmerkung:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">Der Backup-Server kann nur auf einem Computer konfiguriert werden, der als
Database Server konfiguriert ist. Ist der Backup-Server au&szlig;erdem auf
irgendeinem Database Server in der Zelle konfiguriert, mu&szlig; er auf
<I>allen</I> Database Servern in der Zelle konfiguriert werden.
</TD></TR></TABLE>
</LI><P><LI>W&auml;hlen Sie die Option <B>Als Backup-Server konfigurieren</B>, wenn Sie
diesen AFS Server als Backup-Server konfigurieren m&ouml;chten. Andernfalls
w&auml;hlen Sie die Option <B>Nicht als Backup-Server konfigurieren</B>.
</LI><P><LI>Klicken Sie auf die Schaltfl&auml;che <B>Weiter</B>. Das
Dialogfenster <B>AFS-Partition</B> wird angezeigt. 
<P>Wenn Sie diesen AFS Server als File Server konfigurieren, m&uuml;ssen Sie ein
NTFS-Volume angeben, das als AFS-Partition eingerichtet werden soll.
Jeder AFS File Server mu&szlig; mindestens eine Partition besitzen, die
ausschlie&szlig;lich f&uuml;r die Speicherung von AFS-Volumes reserviert ist. Alle
AFS-Volumes m&uuml;ssen sich auf Partitionen befinden, die als AFS-Partitionen
eingerichtet wurden. Auf einem Windows NT-Computer k&ouml;nnen nur
NTFS-Volumes als AFS-Partitionen eingerichtet werden. Au&szlig;erdem k&ouml;nnen
AFS-Partitionen nur auf NTFS-Volumes erstellt werden, die leer sind (oder nur
den Windows NT-Papierkorb enthalten).
<P>Um ein Volume als AFS-Partition einzurichten, w&auml;hlen Sie die Option
<B>Ja, eine Partition erstellen</B>. W&auml;hlen Sie in der Liste der
NTFS-Volumes das Volume aus, das Sie als AFS-Partition einrichten
m&ouml;chten. Geben Sie im Feld <B>AFS-Partitionsname</B> den letzten
Teil des Partitionsnamens ein.
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Anmerkung:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">Auf einem AFS Server k&ouml;nnen bis zu 256 AFS-Partitionen existieren.
Standardm&auml;&szlig;ig hat eine Partition den Namen <B>/vicep</B><I>x</I>,
wobei <I>x</I> f&uuml;r einen oder zwei Kleinbuchstaben steht.
AFS-Partitionen k&ouml;nnen <B>/vicepa</B>, <B>/vicepb</B> usw. bis
<B>/vicepz</B> hei&szlig;en. Zus&auml;tzliche Partitionen k&ouml;nnen mit
<B>/vicepaa</B> bis <B>vicepaz</B> usw. bis <B>/vicepiv</B>
benannt werden.
</TD></TR></TABLE>
<P>Es wird unbedingt empfohlen, den Laufwerkbuchstaben des NTFS-Volumes als
letzten Buchstaben des Partitionsnamens zu verwenden.
<P>Wenn Sie kein Volume als AFS-Partition definieren m&ouml;chten, w&auml;hlen Sie die
Option <B>Nein, keine Partition erstellen</B>.
</LI><P><LI>Klicken Sie auf die Schaltfl&auml;che <B>Weiter</B>. Das
Dialogfenster <B>AFS-Root-Volumes</B> wird angezeigt. 
<P>Die AFS-Root-Volumes sind zwei Volumes, die im Dateisystem jeder AFS-Zelle
enthalten sein m&uuml;ssen. Sie haben folgende Namen:
<UL>
<P><LI><B>root.afs</B>: das Volume, das der obersten Ebene
(<B>/afs</B>) des AFS-Dateibereichs entspricht.
</LI><P><LI><B>root.cell</B>: das Volume, das direkt unter
<B>/afs</B> am Namen der Zelle angeh&auml;ngt ist (z.B.
<B>/afs/ihrefirma.com</B> in der Zelle
<B>ihrefirma.com</B>).
</LI></UL>
<A NAME="IDX253"></A>
Da Sie diesen AFS Server einer vorhandenen AFS-Zelle hinzuf&uuml;gen, sind die
AFS-Volumes bereits in der Zelle vorhanden, und der Assistent AFS
Configuration weist Sie darauf hin, da&szlig; Sie keine Root-Volumes erstellen
m&uuml;ssen. 
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Anmerkung:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">Falls die AFS-Root-Volumes aus irgendeinem Grund nicht in dieser AFS-Zelle
existieren, w&auml;hlen Sie die Option <B>Root-Volumes erstellen</B>, um die
Root-Volumes auf diesem AFS Server einzurichten.
</TD></TR></TABLE>
</LI><P><LI>Klicken Sie auf die Schaltfl&auml;che <B>Weiter</B>. Das
Dialogfenster <B>Nachbildung</B> wird angezeigt. 
<P>Wenn Sie die Nachbildungsfunktionen von AFS nutzen m&ouml;chten, m&uuml;ssen Sie die
AFS-Root-Volumes replizieren. Bei der Nachbildung werden eine oder
mehrere schreibgesch&uuml;tzte Kopien eines AFS-Volumes erstellt und an einen oder
mehrere andere Standorte verteilt (AFS-Partitionen und -Server). Die
Nachbildung f&uuml;hrt zu einer Steigerung der Systemleistung und zu einer besseren
Datenverf&uuml;gbarkeit, da sie den Inhalt eines AFS-Volumes auf einem oder
mehreren AFS File Server-Computern zur Verf&uuml;gung stellt.
<P>Da Sie diesen AFS Server einer vorhandenen AFS-Zelle hinzuf&uuml;gen, sind die
AFS-Root-Volumes wahrscheinlich bereits repliziert, und der Assistent AFS
Server Configuration weist Sie darauf hin, da&szlig; Sie die AFS-Root-Volumes nicht
replizieren m&uuml;ssen. 
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Anmerkung:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">Falls die AFS-Root-Volumes aus irgendeinem Grund in dieser AFS-Zelle noch
nicht repliziert sind, w&auml;hlen Sie die Option <B>Root-Volumes
nachbilden</B>, um die Root-Volumes der AFS-Zelle auf diesem AFS Server zu
replizieren.
</TD></TR></TABLE>
</LI><P><LI>Klicken Sie auf die Schaltfl&auml;che <B>Weiter</B>. Das
Dialogfenster <B>System Control Service</B> wird angezeigt. 
<P>In Zellen, in denen die landesspezifische Version von AFS f&uuml;r Windows
ausgef&uuml;hrt wird, verteilt der System Control Server neue Versionen der AFS
Server-Konfigurationsdaten an alle AFS-Server, und die System Control
Client-Computer rufen allgemeine AFS-Konfigurationsdateien vom System
Control-Computer ab. (Bei Zellen, in denen die internationale Version
von AFS f&uuml;r Windows ausgef&uuml;hrt wird, wird der System Control Server nicht zum
Verteilen der Systemkonfigurationsdaten verwendet, und der System Control
Client ruft nicht diese Dateien ab.)
</LI><P><LI>Um diesen AFS-Server als System Control Server f&uuml;r die AFS-Zelle zu
konfigurieren, w&auml;hlen Sie die Option <B>Als System Control Server
konfigurieren</B>. Um diesen AFS Server als System Control Client zu
konfigurieren, w&auml;hlen Sie die Option <B>Als System Control Client
konfigurieren</B> und geben den Host-Namen des System Control Servers in
dieser AFS-Zelle ein. Der AFS Server ruft neue Versionen der AFS
Server-Konfigurationsdaten vom angegebenen Server ab. Wenn Sie diesen
AFS Server nicht als System Control Server f&uuml;r die AFS-Zelle oder als System
Control Client konfigurieren m&ouml;chten, w&auml;hlen Sie die Option <B>Nicht als
System Control Client oder Server konfigurieren</B>.
</LI><P><LI>Klicken Sie auf die Schaltfl&auml;che <B>Weiter</B>. Das
Dialogfenster <B>Das System konfigurieren</B> wird angezeigt. 
<P>Eine Liste der Konfigurationsschritte f&uuml;r diesen AFS Server wird
angezeigt. Lesen Sie sich die Schritte durch, bevor Sie mit dem
Konfigurationsproze&szlig; beginnen. 
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Anmerkung:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">Um zu einem vorherigen Schritt zur&uuml;ckzukehren oder Ihre Auswahl zu &auml;ndern,
klicken Sie auf die Schaltfl&auml;che <B>Zur&uuml;ck</B>.
</TD></TR></TABLE>
</LI><P><LI>Um mit der Konfiguration von AFS Server auf diesem Computer zu beginnen,
klicken Sie auf die Schaltfl&auml;che <B>Konfigurieren</B>. Wenn Sie den
AFS Server in einer AFS-Zelle konfigurieren, in der Database Server eine
&auml;ltere Version von AFS als Version 3.5 ausf&uuml;hren, wird ein
Dialogfenster angezeigt, in dem Sie zur Eingabe des Kennworts f&uuml;r den
AFS-Principal aufgefordert werden. 
<P>Der AFS Server wird gem&auml;&szlig; Ihren Angaben konfiguriert. Der
Statusbalken am unteren Rand des Dialogfensters zeigt an, welche Schritte
gerade ausgef&uuml;hrt werden. Anschlie&szlig;end wird eine Meldung mit dem
Hinweis angezeigt, da&szlig; die Konfiguration abgeschlossen ist.
</LI></OL>
<P><H3><A NAME="Header_28" HREF="awqbg002.htm#ToC_28">Vorgehensweise zum Konfigurieren von AFS Control Center</A></H3>
<A NAME="IDX254"></A>
<A NAME="IDX255"></A>
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Anmerkung:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">Wenn Sie das AFS Control Center in Verbindung mit dem AFS Server, dem AFS
Client oder beiden Komponenten installiert haben, brauchen Sie das AFS Control
Center nicht zu konfigurieren. Das AFS Control Center wird w&auml;hrend der
Konfiguration von AFS Server oder AFS Client automatisch mit
konfiguriert. Wenn Sie dagegen nur das AFS Control Center installiert
haben, m&uuml;ssen Sie es vor der Verwendung auf dem System konfigurieren.
</TD></TR></TABLE>
<OL TYPE=1>
<P><LI>Zeigen Sie im Men&uuml; <B>Start</B> auf <B>Einstellungen</B>, und
klicken Sie auf <B>Systemsteuerung</B>.
</LI><P><LI>Doppelklicken Sie auf das Symbol <B>AFS Control Center</B>. Das
Dialogfenster <B>Merkmale f&uuml;r AFS Control Center</B> wird
angezeigt.
</LI><P><LI>Geben Sie im Feld <B>Standardzelle</B> den vollst&auml;ndigen Namen der
AFS-Zelle ein, die standardm&auml;&szlig;ig zu verwalten ist.
</LI><P><LI>Falls die Zelle, die durch das AFS Control Center verwaltet werden soll,
nicht in der Liste der AFS-Zellen enthalten ist, klicken Sie auf die
Schaltfl&auml;che <B>Hinzuf&uuml;gen</B>. Das Dialogfenster <B>Neue
Zelle</B> wird ge&ouml;ffnet. Geben Sie im Feld <B>AFS-Zelle</B> den
Zellennamen ein und im Feld <B>Beschreibung</B> eine kurze
Beschreibung.
<P>Klicken Sie auf die Schaltfl&auml;che <B>Hinzuf&uuml;gen</B>. Das
Dialogfenster <B>Server hinzuf&uuml;gen</B> wird ge&ouml;ffnet. Geben Sie im
Feld <B>Server-Name</B> den Namen eines Volume Location Servers in der
ausgew&auml;hlten Zelle ein. Klicken Sie auf <B>OK</B>, um das
Dialogfenster <B>Server hinzuf&uuml;gen</B> zu schlie&szlig;en. Wiederholen
Sie diesen Vorgang, um die Informationen f&uuml;r alle Volume Location Server in
der Zelle hinzuzuf&uuml;gen. Nachdem Sie alle Server-Daten eingegeben haben,
klicken Sie auf <B>OK</B>, um das Dialogfenster <B>Neue Zelle</B> zu
schlie&szlig;en.
</LI><P><LI>Klicken Sie auf <B>OK</B>, um das Dialogfenster <B>Merkmale f&uuml;r AFS
Control Center</B> zu schlie&szlig;en.
</LI></OL>
<P>Das AFS Control Center ist nun konfiguriert.
<A NAME="IDX256"></A>
<HR><H2><A NAME="HDRUNINSTALL" HREF="awqbg002.htm#ToC_29">Deinstallieren von AFS f&uuml;r Windows</A></H2>
<P>In diesem Abschnitt werden die Voraussetzungen f&uuml;r die Deinstallation,
das Verfahren zur Deinstallation von AFS f&uuml;r Windows und die &Auml;nderungen
beschrieben, die bei der Deinstallation am System vorgenommen werden.
<A NAME="IDX257"></A>
<A NAME="IDX258"></A>
<P><H3><A NAME="Header_30" HREF="awqbg002.htm#ToC_30">Neuinstallieren und Erweitern</A></H3>
<P>Auf einem Windows NT-Computer ist es <I>nicht</I> erforderlich, zum
Zwecke der erneuten Installation oder der Erweiterung der Software die
Komponenten von AFS f&uuml;r Windows zu deinstallieren. Gehen Sie nach dem
Installationsverfahren im Abschnitt <A HREF="#HDRHOWTOINSTALL">Vorgehensweise zum Installieren von AFS f&uuml;r Windows</A> vor, um AFS f&uuml;r Windows erneut zu installieren oder zu
erweitern. W&auml;hrend des Installationsvorgangs werden die bisher
installierten AFS-Komponenten &uuml;berschrieben. Die
AFS-Konfigurationsdaten bleiben erhalten.
<P>Auf einem Windows 95- oder Windows 98-Computer m&uuml;ssen Sie die bisher
installierte AFS Light-Komponente deinstallieren, wie im Abschnitt <A HREF="#HDRTOUNINSTALL">Vorgehensweise zum Deinstallieren von AFS f&uuml;r Windows</A> beschrieben, bevor Sie AFS Light erneut installieren oder
erweitern.
<A NAME="IDX259"></A>
<A NAME="IDX260"></A>
<A NAME="IDX261"></A>
<P><H3><A NAME="Header_31" HREF="awqbg002.htm#ToC_31">Deinstallationsvoraussetzungen</A></H3>
<P>Bei der Deinstallation von AFS werden alle AFS-Anwendungsdateien
gel&ouml;scht. Diese Dateien k&ouml;nnen nicht gel&ouml;scht werden, wenn sie von
anderen Anwendungen genutzt werden. Deshalb m&uuml;ssen Sie alle
AFS-Dialogfenster schlie&szlig;en, bevor Sie AFS f&uuml;r Windows deinstallieren.
<P>Wenn Sie den AFS Server deinstallieren, um den Computer au&szlig;er Dienst zu
stellen, m&uuml;ssen folgende Voraussetzungen erf&uuml;llt sein, damit es nicht zu einem
Datenverlust kommt. 
<OL TYPE=1>
<P><LI>Fungiert der AFS Server als File Server, verschieben Sie alle Volumes mit
Schreib-/Lesezugriff auf einen anderen AFS File Server, und entfernen Sie alle
schreibgesch&uuml;tzten Volumes.
</LI><P><LI>Dekonfigurieren Sie den AFS Server. Starten Sie das Dienstprogramm
AFS Server Configuration, und klicken Sie auf die Registerkarte
<B>Server</B>. Deaktivieren Sie alle Kontrollk&auml;stchen, und klicken
Sie auf <B>OK</B>.
</LI></OL>
<A NAME="IDX262"></A>
<A NAME="IDX263"></A>
<A NAME="IDX264"></A>
<A NAME="IDX265"></A>
<A NAME="IDX266"></A>
<A NAME="IDX267"></A>
<A NAME="IDX268"></A>
<P><H3><A NAME="HDRTOUNINSTALL" HREF="awqbg002.htm#ToC_32">Vorgehensweise zum Deinstallieren von AFS f&uuml;r Windows</A></H3>
<OL TYPE=1>
<P><LI>Zeigen Sie im Men&uuml; <B>Start</B> auf <B>Einstellungen</B>, und
klicken Sie auf <B>Systemsteuerung</B>.
</LI><P><LI>Doppelklicken Sie auf das Symbol <B>Software</B>. Das
Dialogfenster <B>Eigenschaften von Software</B> wird mit der ge&ouml;ffneten
Registerkarte <B>Installieren/Deinstallieren</B> angezeigt.
</LI><P><LI>Schlie&szlig;en Sie die Systemsteuerung.
</LI><P><LI>W&auml;hlen Sie die AFS-Komponente aus, die deinstalliert werden soll, und
klicken Sie auf die Schaltfl&auml;che <B>Hinzuf&uuml;gen/Entfernen</B>. Das
Dialogfenster <B>L&ouml;schen einer Datei best&auml;tigen</B> wird angezeigt, in dem
Sie best&auml;tigen, da&szlig; Sie die ausgew&auml;hlte Komponente von AFS f&uuml;r Windows
entfernen m&ouml;chten. Klicken Sie auf <B>Ja</B>, um die Deinstallation
fortzusetzen.
</LI><P><LI>Sie werden in einer AFS-Meldung gefragt, ob die Konfigurationsdaten
erhalten bleiben sollen. W&auml;hlen Sie <B>Ja</B>, wenn die
Konfigurationsdaten beibehalten werden sollen, bzw. <B>Nein</B>,
wenn alle Konfigurationsdaten gel&ouml;scht werden sollen. (Mit der
Komponente AFS Supplemental Documentation sind keine Konfigurationsdaten
verbunden. Wenn Sie diese Komponente vom System entfernen, wird diese
AFS-Meldung nicht angezeigt.)
</LI><P><LI>Das Dialogfenster <B>Programme vom Computer entfernen</B> wird
ge&ouml;ffnet. Es zeigt an, welche Komponenten vom System gel&ouml;scht
werden. 
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Anmerkung:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">M&ouml;glicherweise wird eine Meldung angezeigt, in der Sie gefragt werden, ob
gemeinsam genutzte AFS-Dateien, die von anderen Komponenten nicht mehr
ben&ouml;tigt werden, entfernt werden sollen. Klicken Sie auf <B>Alle
ja</B>, um die ausgew&auml;hlte AFS-Komponente vollst&auml;ndig zu l&ouml;schen.
</TD></TR></TABLE>
</LI></OL>
<P>Die ausgew&auml;hlte Komponente von AFS f&uuml;r Windows ist jetzt
deinstalliert. Wenn Sie eine Kombination aus AFS f&uuml;r
Windows-Komponenten installiert haben, m&uuml;ssen Sie die Schritte 4-6 f&uuml;r
jede einzelne Komponente ausf&uuml;hren.
<P><H3><A NAME="Header_33" HREF="awqbg002.htm#ToC_33">&Auml;nderungen am System</A></H3>
<A NAME="IDX269"></A>
<P><H4><A NAME="Header_34">&Auml;nderungen am System durch Deinstallation des AFS Clients</A></H4>
<P>Wenn Sie den AFS Client deinstallieren, werden folgende &Auml;nderungen am
System durchgef&uuml;hrt:
<UL>
<P><LI>Alle AFS Client-Dateien werden aus dem Verzeichnis
<B>\Programme\Ibm\Afs\Client\Program</B> gel&ouml;scht, das Verzeichnis
<B>Client</B> wird entfernt, und falls keine anderen AFS-Komponenten
installiert bleiben, wird das Verzeichnis <B>Ibm</B> gel&ouml;scht. 
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Anmerkung:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">Die Verzeichnisse werden <I>nicht</I> entfernt, wenn sie andere Dateien
enthalten als die, die durch das Programm <B>setup</B> von AFS f&uuml;r Windows
installiert wurden.
</TD></TR></TABLE>
</LI><P><LI>Die Programmgruppe <B>IBM AFS</B> wird aus dem Men&uuml; <B>Start</B>
entfernt, wenn keine anderen AFS-Komponenten installiert bleiben.
</LI><P><LI>Das Symbol <B>AFS Client Configuration</B> wird aus der
Systemsteuerung gel&ouml;scht.
</LI><P><LI>Das Men&uuml; <B>AFS</B> wird aus dem Kontextmen&uuml; des Windows NT-Explorers
entfernt.
</LI><P><LI>Der Service <B>IBM AFS Client</B> wird gel&ouml;scht.
</LI><P><LI>Die Eintr&auml;ge in der Registrierungsdatenbank f&uuml;r den AFS Client werden aus
dem System gel&ouml;scht. Beachten Sie, da&szlig; bei der Deinstallation bestimmte
Informationen in der Registrierungsdatenbank verbleiben, wenn Sie festgelegt
haben, da&szlig; die Konfigurationsdaten erhalten bleiben sollen.
</LI></UL>
<P><H4><A NAME="Header_35">&Auml;nderungen am System durch Deinstallation von AFS Light</A></H4>
<P>Wenn Sie AFS Light deinstallieren, werden folgende &Auml;nderungen am System
durchgef&uuml;hrt:
<UL>
<P><LI>Alle AFS-Dateien werden aus dem Verzeichnis
<B>\Programme\Ibm\Afs\Client\Program</B> gel&ouml;scht, und das Verzeichnis
<B>Ibm</B> wird entfernt. 
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Anmerkung:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">Die Verzeichnisse werden <I>nicht</I> entfernt, wenn sie andere Dateien
enthalten als die, die durch das Programm <B>setup</B> von AFS f&uuml;r Windows
installiert wurden.
</TD></TR></TABLE>
</LI><P><LI>Die Programmgruppe <B>IBM AFS</B> wird aus dem Men&uuml; <B>Start</B>
entfernt.
</LI><P><LI>Das Symbol <B>AFS Light Configuration</B> wird aus der Systemsteuerung
gel&ouml;scht.
</LI><P><LI>Das Men&uuml; <B>AFS</B> wird aus dem Kontextmen&uuml; des Windows-Explorers
entfernt.
</LI><P><LI>Die Eintr&auml;ge in der Registrierungsdatenbank f&uuml;r AFS Light werden aus dem
System gel&ouml;scht. Beachten Sie, da&szlig; bei der Deinstallation bestimmte
Informationen in der Registrierungsdatenbank verbleiben, wenn Sie festgelegt
haben, da&szlig; die Konfigurationsdaten erhalten bleiben sollen.
</LI></UL>
<P><H4><A NAME="Header_36">&Auml;nderungen am System durch Deinstallation von AFS Server</A></H4>
<P>Wenn Sie den AFS Server deinstallieren, werden folgende &Auml;nderungen am
System durchgef&uuml;hrt:
<UL>
<P><LI>Alle AFS Server-Dateien werden aus dem Verzeichnis
<B>\Programme\Ibm\Afs\Server</B> gel&ouml;scht, das Verzeichnis
<B>Server</B> wird entfernt, und falls keine anderen AFS-Komponenten
installiert bleiben, wird das Verzeichnis <B>Ibm</B> gel&ouml;scht. 
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Anmerkung:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">Die Verzeichnisse werden <I>nicht</I> entfernt, wenn sie andere Dateien
enthalten als die, die durch das Programm <B>setup</B> von AFS f&uuml;r Windows
installiert wurden. Wenn Sie festgelegt haben, da&szlig; die
Konfigurationsdaten erhalten bleiben sollen, werden manche Dateien im
Verzeichnis <B>\Programme\Ibm\Afs\Server</B> <I>nicht</I>
entfernt.
</TD></TR></TABLE>
</LI><P><LI>Die Programmgruppe <B>IBM AFS</B> wird aus dem Men&uuml; <B>Start</B>
entfernt, wenn keine anderen AFS-Komponenten installiert bleiben.
</LI><P><LI>Das Symbol <B>AFS Server Configuration</B> wird aus der
Systemsteuerung gel&ouml;scht.
</LI><P><LI>Der Service <B>IBM AFS Server</B> wird gel&ouml;scht.
</LI><P><LI>Die Eintr&auml;ge in der Registrierungsdatenbank f&uuml;r AFS Server werden aus dem
System gel&ouml;scht. Beachten Sie, da&szlig; bei der Deinstallation bestimmte
Informationen in der Registrierungsdatenbank verbleiben, wenn Sie festgelegt
haben, da&szlig; die Konfigurationsdaten erhalten bleiben sollen.
</LI></UL>
<P><H4><A NAME="Header_37">&Auml;nderungen am System durch Deinstallation des AFS Control Centers</A></H4>
<P>Wenn Sie das AFS Control Center deinstallieren, werden folgende
&Auml;nderungen am System durchgef&uuml;hrt:
<UL>
<P><LI>Alle AFS Control Center-Dateien werden aus dem Verzeichnis
<B>\Programme\Ibm\Afs\Control Center</B> gel&ouml;scht, das Verzeichnis
<B>Control Center</B> wird entfernt, und falls keine anderen
AFS-Komponenten installiert bleiben, wird das Verzeichnis <B>Ibm</B>
gel&ouml;scht. 
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Anmerkung:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">Die Verzeichnisse werden <I>nicht</I> entfernt, wenn sie andere Dateien
enthalten als die, die durch das Programm <B>setup</B> von AFS f&uuml;r Windows
installiert wurden.
</TD></TR></TABLE>
</LI><P><LI>Die Programmgruppe <B>IBM AFS</B> wird aus dem Men&uuml; <B>Start</B>
entfernt, wenn keine anderen AFS-Komponenten installiert bleiben.
</LI><P><LI>Das Symbol <B>AFS Control Center</B> wird aus der Systemsteuerung
gel&ouml;scht. Dieses Symbol wird nur dann in der Systemsteuerung angezeigt,
wenn keine anderen Komponenten von AFS f&uuml;r Windows auf dem System installiert
sind.
</LI><P><LI>Die Eintr&auml;ge in der Registrierungsdatenbank f&uuml;r AFS Control Center werden
aus dem System gel&ouml;scht. Beachten Sie, da&szlig; bei der Deinstallation
bestimmte Informationen in der Registrierungsdatenbank verbleiben, wenn Sie
festgelegt haben, da&szlig; die Konfigurationsdaten erhalten bleiben sollen.
</LI></UL>
<P><H4><A NAME="Header_38">&Auml;nderungen am System durch Deinstallation der Komponente AFS Supplemental Documentation</A></H4>
<P>Wenn Sie AFS Supplemental Documentation deinstallieren, werden folgende
&Auml;nderungen am System durchgef&uuml;hrt:
<UL>
<P><LI>Die Verzeichnisse <B>SysAdminGd</B> und <B>CmdRef</B> werden aus
dem Verzeichnis <B>\Programme\Ibm\Afs\Documentation\Html</B> gel&ouml;scht, und
falls keine anderen AFS-Komponenten installiert bleiben, wird das Verzeichnis
<B>Ibm</B> entfernt. 
<TABLE><TR><TD ALIGN="LEFT" VALIGN="TOP"><B>Anmerkung:</B></TD><TD ALIGN="LEFT" VALIGN="TOP">Die Verzeichnisse werden <I>nicht</I> entfernt, wenn sie andere Dateien
enthalten als die, die durch das Programm <B>setup</B> von AFS f&uuml;r Windows
installiert wurden.
</TD></TR></TABLE>
</LI><P><LI>Die Programmgruppe <B>IBM AFS</B> wird aus dem Men&uuml; <B>Start</B>
entfernt, wenn keine anderen AFS-Komponenten installiert bleiben.
</LI><P><LI>Die Eintr&auml;ge in der Registrierungsdatenbank f&uuml;r AFS Supplemental
Documentation werden aus dem System gel&ouml;scht.
</LI></UL>
<P><HR><B>&#91; <A HREF="#Top_Of_Page">Seitenanfang</A> &#124; <A HREF="awqbg002.htm">Vorherige Seite</A> &#124; <A HREF="awqbg004.htm">N&auml;chste Seite</A> &#124; <A HREF="awqbg002.htm#ToC">Inhaltsverzeichnis</A> &#124; <A HREF="awqbg004.htm#HDRINDEX">Index</A> &#93;</B> 
<!-- Begin Footer Records  ========================================== -->
<B> 
<br>&#169; <A HREF="http://www.ibm.com/">IBM Corporation 2000.</A>  </B> 
<!-- End Footer Records  ============================================ -->
<A NAME="Bot_Of_Page"></A>
</BODY></HTML>
